--- tmp/fastcons-0.1.3-cp311-cp311-musllinux_1_1_x86_64.whl.zip
+++ tmp/fastcons-0.2.0-cp311-cp311-musllinux_1_1_x86_64.whl.zip
├── zipinfo {}
│ @@ -1,10 +1,10 @@
│ -Zip file size: 28104 bytes, number of entries: 8
│ -drwxr-xr-x  2.0 unx        0 b- stor 23-Apr-06 21:01 fastcons-0.1.3.dist-info/
│ -drwxr-xr-x  2.0 unx        0 b- stor 23-Apr-06 21:01 fastcons.libs/
│ --rwxr-xr-x  2.0 unx    67000 b- defN 23-Apr-06 21:01 fastcons.cpython-311-x86_64-linux-musl.so
│ --rw-r--r--  2.0 unx      113 b- defN 23-Apr-06 21:01 fastcons-0.1.3.dist-info/WHEEL
│ --rw-r--r--  2.0 unx       20 b- defN 23-Apr-06 21:01 fastcons-0.1.3.dist-info/top_level.txt
│ --rw-r--r--  2.0 unx     1069 b- defN 23-Apr-06 21:01 fastcons-0.1.3.dist-info/LICENSE.txt
│ --rw-rw-r--  2.0 unx      501 b- defN 23-Apr-06 21:01 fastcons-0.1.3.dist-info/RECORD
│ --rw-r--r--  2.0 unx     2310 b- defN 23-Apr-06 21:01 fastcons-0.1.3.dist-info/METADATA
│ -8 files, 71013 bytes uncompressed, 26978 bytes compressed:  62.0%
│ +Zip file size: 29762 bytes, number of entries: 8
│ +drwxr-xr-x  2.0 unx        0 b- stor 23-Apr-07 17:00 fastcons.libs/
│ +drwxr-xr-x  2.0 unx        0 b- stor 23-Apr-07 17:00 fastcons-0.2.0.dist-info/
│ +-rwxr-xr-x  2.0 unx    71016 b- defN 23-Apr-07 17:00 fastcons.cpython-311-x86_64-linux-musl.so
│ +-rw-r--r--  2.0 unx      113 b- defN 23-Apr-07 17:00 fastcons-0.2.0.dist-info/WHEEL
│ +-rw-r--r--  2.0 unx       20 b- defN 23-Apr-07 17:00 fastcons-0.2.0.dist-info/top_level.txt

│ │ -    <194>   DW_AT_name        : (strp) (offset: 0x2141): uint32_t
│ │ -    <198>   DW_AT_decl_file   : (data1) 4
│ │ +    <194>   DW_AT_name        : (strp) (offset: 0x2172): uint32_t
│ │ +    <198>   DW_AT_decl_file   : (data1) 5
│ │      <199>   DW_AT_decl_line   : (data1) 172
│ │      <19a>   DW_AT_decl_column : (data1) 25
│ │      <19b>   DW_AT_type        : (ref4) <0x7c>, unsigned int
│ │   <1><19f>: Abbrev Number: 3 (DW_TAG_typedef)
│ │ -    <1a0>   DW_AT_name        : (strp) (offset: 0x1e00): uint64_t
│ │ -    <1a4>   DW_AT_decl_file   : (data1) 4
│ │ +    <1a0>   DW_AT_name        : (strp) (offset: 0x1e31): uint64_t
│ │ +    <1a4>   DW_AT_decl_file   : (data1) 5
│ │      <1a5>   DW_AT_decl_line   : (data1) 177
│ │      <1a6>   DW_AT_decl_column : (data1) 25
│ │      <1a7>   DW_AT_type        : (ref4) <0x62>, long unsigned int
│ │   <1><1ab>: Abbrev Number: 3 (DW_TAG_typedef)
│ │ -    <1ac>   DW_AT_name        : (strp) (offset: 0x1978): Py_ssize_t
│ │ -    <1b0>   DW_AT_decl_file   : (data1) 8
│ │ +    <1ac>   DW_AT_name        : (strp) (offset: 0x199d): Py_ssize_t
│ │ +    <1b0>   DW_AT_decl_file   : (data1) 9
│ │      <1b1>   DW_AT_decl_line   : (data1) 131
│ │      <1b2>   DW_AT_decl_column : (data1) 25
│ │      <1b3>   DW_AT_type        : (ref4) <0x8a>, ssize_t, long int
│ │   <1><1b7>: Abbrev Number: 3 (DW_TAG_typedef)
│ │      <1b8>   DW_AT_name        : (strp) (offset: 0x57e): Py_hash_t
│ │ -    <1bc>   DW_AT_decl_file   : (data1) 8
│ │ +    <1bc>   DW_AT_decl_file   : (data1) 9
│ │      <1bd>   DW_AT_decl_line   : (data1) 145
│ │      <1be>   DW_AT_decl_column : (data1) 20
│ │      <1bf>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
│ │   <1><1c3>: Abbrev Number: 4 (DW_TAG_base_type)
│ │      <1c4>   DW_AT_byte_size   : (data1) 4
│ │      <1c5>   DW_AT_encoding    : (data1) 4	(float)
│ │      <1c6>   DW_AT_name        : (strp) (offset: 0x872): float
│ │   <1><1ca>: Abbrev Number: 11 (DW_TAG_variable)
│ │ -    <1cb>   DW_AT_name        : (strp) (offset: 0x1969): signgam
│ │ -    <1cf>   DW_AT_decl_file   : (data1) 9
│ │ +    <1cb>   DW_AT_name        : (strp) (offset: 0x198e): signgam
│ │ +    <1cf>   DW_AT_decl_file   : (data1) 10
│ │      <1d0>   DW_AT_decl_line   : (data2) 384
│ │      <1d2>   DW_AT_decl_column : (data1) 12
│ │      <1d3>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <1d7>   DW_AT_external    : (flag_present) 1
│ │      <1d7>   DW_AT_declaration : (flag_present) 1
│ │   <1><1d7>: Abbrev Number: 12 (DW_TAG_array_type)
│ │      <1d8>   DW_AT_type        : (ref4) <0xea>, char
│ │      <1dc>   DW_AT_sibling     : (ref4) <0x1e7>
│ │   <2><1e0>: Abbrev Number: 13 (DW_TAG_subrange_type)
│ │      <1e1>   DW_AT_type        : (ref4) <0x62>, long unsigned int
│ │      <1e5>   DW_AT_upper_bound : (data1) 1
│ │   <2><1e6>: Abbrev Number: 0
│ │   <1><1e7>: Abbrev Number: 9 (DW_TAG_variable)
│ │ -    <1e8>   DW_AT_name        : (strp) (offset: 0x155c): tzname
│ │ -    <1ec>   DW_AT_decl_file   : (data1) 10
│ │ +    <1e8>   DW_AT_name        : (strp) (offset: 0x1581): tzname
│ │ +    <1ec>   DW_AT_decl_file   : (data1) 11
│ │      <1ed>   DW_AT_decl_line   : (data1) 114
│ │      <1ee>   DW_AT_decl_column : (data1) 14
│ │      <1ef>   DW_AT_type        : (ref4) <0x1d7>, char
│ │      <1f3>   DW_AT_external    : (flag_present) 1
│ │      <1f3>   DW_AT_declaration : (flag_present) 1
│ │   <1><1f3>: Abbrev Number: 9 (DW_TAG_variable)
│ │ -    <1f4>   DW_AT_name        : (strp) (offset: 0x2341): daylight
│ │ -    <1f8>   DW_AT_decl_file   : (data1) 10
│ │ +    <1f4>   DW_AT_name        : (strp) (offset: 0x2382): daylight
│ │ +    <1f8>   DW_AT_decl_file   : (data1) 11
│ │      <1f9>   DW_AT_decl_line   : (data1) 121
│ │      <1fa>   DW_AT_decl_column : (data1) 12
│ │      <1fb>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <1ff>   DW_AT_external    : (flag_present) 1
│ │      <1ff>   DW_AT_declaration : (flag_present) 1
│ │   <1><1ff>: Abbrev Number: 9 (DW_TAG_variable)
│ │ -    <200>   DW_AT_name        : (strp) (offset: 0xa41): timezone
│ │ -    <204>   DW_AT_decl_file   : (data1) 10
│ │ +    <200>   DW_AT_name        : (strp) (offset: 0xa4e): timezone
│ │ +    <204>   DW_AT_decl_file   : (data1) 11
│ │      <205>   DW_AT_decl_line   : (data1) 122
│ │      <206>   DW_AT_decl_column : (data1) 13
│ │      <207>   DW_AT_type        : (ref4) <0x6e>, long int
│ │      <20b>   DW_AT_external    : (flag_present) 1
│ │      <20b>   DW_AT_declaration : (flag_present) 1
│ │   <1><20b>: Abbrev Number: 9 (DW_TAG_variable)
│ │ -    <20c>   DW_AT_name        : (strp) (offset: 0x2119): getdate_err
│ │ -    <210>   DW_AT_decl_file   : (data1) 10
│ │ +    <20c>   DW_AT_name        : (strp) (offset: 0x214a): getdate_err
│ │ +    <210>   DW_AT_decl_file   : (data1) 11
│ │      <211>   DW_AT_decl_line   : (data1) 123
│ │      <212>   DW_AT_decl_column : (data1) 12
│ │      <213>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <217>   DW_AT_external    : (flag_present) 1
│ │      <217>   DW_AT_declaration : (flag_present) 1
│ │   <1><217>: Abbrev Number: 14 (DW_TAG_structure_type)
│ │ -    <218>   DW_AT_name        : (strp) (offset: 0x1256): PyModuleDef
│ │ +    <218>   DW_AT_name        : (strp) (offset: 0x127b): PyModuleDef
│ │      <21c>   DW_AT_byte_size   : (data1) 104
│ │ -    <21d>   DW_AT_decl_file   : (data1) 11
│ │ +    <21d>   DW_AT_decl_file   : (data1) 12
│ │      <21e>   DW_AT_decl_line   : (data1) 74
│ │      <21f>   DW_AT_decl_column : (data1) 8
│ │      <220>   DW_AT_sibling     : (ref4) <0x29a>
│ │   <2><224>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <225>   DW_AT_name        : (strp) (offset: 0x2267): m_base
│ │ -    <229>   DW_AT_decl_file   : (data1) 11
│ │ +    <225>   DW_AT_name        : (strp) (offset: 0x22a8): m_base
│ │ +    <229>   DW_AT_decl_file   : (data1) 12
│ │      <22a>   DW_AT_decl_line   : (data1) 75
│ │      <22b>   DW_AT_decl_column : (data1) 20
│ │      <22c>   DW_AT_type        : (ref4) <0x1a38>, PyModuleDef_Base, PyModuleDef_Base
│ │      <230>   DW_AT_data_member_location: (data1) 0
│ │   <2><231>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <232>   DW_AT_name        : (strp) (offset: 0x1d46): m_name
│ │ -    <236>   DW_AT_decl_file   : (data1) 11
│ │ +    <232>   DW_AT_name        : (strp) (offset: 0x1d77): m_name
│ │ +    <236>   DW_AT_decl_file   : (data1) 12
│ │      <237>   DW_AT_decl_line   : (data1) 76
│ │      <238>   DW_AT_decl_column : (data1) 15
│ │      <239>   DW_AT_type        : (ref4) <0xf0>, char
│ │      <23d>   DW_AT_data_member_location: (data1) 40
│ │   <2><23e>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <23f>   DW_AT_name        : (strp) (offset: 0x136a): m_doc
│ │ -    <243>   DW_AT_decl_file   : (data1) 11
│ │ +    <23f>   DW_AT_name        : (strp) (offset: 0x138f): m_doc
│ │ +    <243>   DW_AT_decl_file   : (data1) 12
│ │      <244>   DW_AT_decl_line   : (data1) 77
│ │      <245>   DW_AT_decl_column : (data1) 15
│ │      <246>   DW_AT_type        : (ref4) <0xf0>, char
│ │      <24a>   DW_AT_data_member_location: (data1) 48
│ │   <2><24b>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <24c>   DW_AT_name        : (strp) (offset: 0xce1): m_size
│ │ -    <250>   DW_AT_decl_file   : (data1) 11
│ │ +    <24c>   DW_AT_name        : (strp) (offset: 0xcfa): m_size
│ │ +    <250>   DW_AT_decl_file   : (data1) 12
│ │      <251>   DW_AT_decl_line   : (data1) 78
│ │      <252>   DW_AT_decl_column : (data1) 14
│ │      <253>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
│ │      <257>   DW_AT_data_member_location: (data1) 56
│ │   <2><258>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <259>   DW_AT_name        : (strp) (offset: 0x23b2): m_methods
│ │ -    <25d>   DW_AT_decl_file   : (data1) 11
│ │ +    <259>   DW_AT_name        : (strp) (offset: 0x23f3): m_methods
│ │ +    <25d>   DW_AT_decl_file   : (data1) 12
│ │      <25e>   DW_AT_decl_line   : (data1) 79
│ │      <25f>   DW_AT_decl_column : (data1) 16
│ │      <260>   DW_AT_type        : (ref4) <0x13ef>, PyMethodDef, PyMethodDef
│ │      <264>   DW_AT_data_member_location: (data1) 64
│ │   <2><265>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <266>   DW_AT_name        : (strp) (offset: 0x17aa): m_slots
│ │ -    <26a>   DW_AT_decl_file   : (data1) 11
│ │ +    <266>   DW_AT_name        : (strp) (offset: 0x17cf): m_slots
│ │ +    <26a>   DW_AT_decl_file   : (data1) 12
│ │      <26b>   DW_AT_decl_line   : (data1) 80
│ │      <26c>   DW_AT_decl_column : (data1) 21
│ │      <26d>   DW_AT_type        : (ref4) <0x1a44>, PyModuleDef_Slot, PyModuleDef_Slot
│ │      <271>   DW_AT_data_member_location: (data1) 72
│ │   <2><272>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <273>   DW_AT_name        : (strp) (offset: 0x184f): m_traverse
│ │ -    <277>   DW_AT_decl_file   : (data1) 11
│ │ +    <273>   DW_AT_name        : (strp) (offset: 0x1874): m_traverse
│ │ +    <277>   DW_AT_decl_file   : (data1) 12
│ │      <278>   DW_AT_decl_line   : (data1) 81
│ │      <279>   DW_AT_decl_column : (data1) 16
│ │      <27a>   DW_AT_type        : (ref4) <0xd29>, traverseproc, int
│ │      <27e>   DW_AT_data_member_location: (data1) 80
│ │   <2><27f>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <280>   DW_AT_name        : (strp) (offset: 0x1176): m_clear
│ │ -    <284>   DW_AT_decl_file   : (data1) 11
│ │ +    <280>   DW_AT_name        : (strp) (offset: 0x119b): m_clear
│ │ +    <284>   DW_AT_decl_file   : (data1) 12
│ │      <285>   DW_AT_decl_line   : (data1) 82
│ │      <286>   DW_AT_decl_column : (data1) 11
│ │      <287>   DW_AT_type        : (ref4) <0xc1f>, inquiry, int
│ │      <28b>   DW_AT_data_member_location: (data1) 88
│ │   <2><28c>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <28d>   DW_AT_name        : (strp) (offset: 0x21d5): m_free
│ │ -    <291>   DW_AT_decl_file   : (data1) 11
│ │ +    <28d>   DW_AT_name        : (strp) (offset: 0x2206): m_free
│ │ +    <291>   DW_AT_decl_file   : (data1) 12
│ │      <292>   DW_AT_decl_line   : (data1) 83
│ │      <293>   DW_AT_decl_column : (data1) 12
│ │      <294>   DW_AT_type        : (ref4) <0xd54>, freefunc
│ │      <298>   DW_AT_data_member_location: (data1) 96
│ │   <2><299>: Abbrev Number: 0
│ │   <1><29a>: Abbrev Number: 3 (DW_TAG_typedef)
│ │ -    <29b>   DW_AT_name        : (strp) (offset: 0x13ab): PyModuleDef_Slot
│ │ -    <29f>   DW_AT_decl_file   : (data1) 12
│ │ +    <29b>   DW_AT_name        : (strp) (offset: 0x13d0): PyModuleDef_Slot
│ │ +    <29f>   DW_AT_decl_file   : (data1) 13
│ │      <2a0>   DW_AT_decl_line   : (data1) 13
│ │      <2a1>   DW_AT_decl_column : (data1) 33
│ │      <2a2>   DW_AT_type        : (ref4) <0x2a6>, PyModuleDef_Slot
│ │   <1><2a6>: Abbrev Number: 14 (DW_TAG_structure_type)
│ │ -    <2a7>   DW_AT_name        : (strp) (offset: 0x13ab): PyModuleDef_Slot
│ │ +    <2a7>   DW_AT_name        : (strp) (offset: 0x13d0): PyModuleDef_Slot
│ │      <2ab>   DW_AT_byte_size   : (data1) 16
│ │ -    <2ac>   DW_AT_decl_file   : (data1) 11
│ │ +    <2ac>   DW_AT_decl_file   : (data1) 12
│ │      <2ad>   DW_AT_decl_line   : (data1) 60
│ │      <2ae>   DW_AT_decl_column : (data1) 8
│ │      <2af>   DW_AT_sibling     : (ref4) <0x2ce>
│ │   <2><2b3>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <2b4>   DW_AT_name        : (strp) (offset: 0x2262): slot
│ │ -    <2b8>   DW_AT_decl_file   : (data1) 11
│ │ +    <2b4>   DW_AT_name        : (strp) (offset: 0x22a3): slot
│ │ +    <2b8>   DW_AT_decl_file   : (data1) 12
│ │      <2b9>   DW_AT_decl_line   : (data1) 61
│ │      <2ba>   DW_AT_decl_column : (data1) 9
│ │      <2bb>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <2bf>   DW_AT_data_member_location: (data1) 0
│ │   <2><2c0>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <2c1>   DW_AT_name        : (strp) (offset: 0xb04): value
│ │ -    <2c5>   DW_AT_decl_file   : (data1) 11
│ │ +    <2c1>   DW_AT_name        : (strp) (offset: 0xb09): value
│ │ +    <2c5>   DW_AT_decl_file   : (data1) 12
│ │      <2c6>   DW_AT_decl_line   : (data1) 62
│ │      <2c7>   DW_AT_decl_column : (data1) 11
│ │      <2c8>   DW_AT_type        : (ref4) <0x88>
│ │      <2cc>   DW_AT_data_member_location: (data1) 8
│ │   <2><2cd>: Abbrev Number: 0
│ │   <1><2ce>: Abbrev Number: 3 (DW_TAG_typedef)
│ │ -    <2cf>   DW_AT_name        : (strp) (offset: 0x185a): PyMethodDef
│ │ -    <2d3>   DW_AT_decl_file   : (data1) 12
│ │ +    <2cf>   DW_AT_name        : (strp) (offset: 0x187f): PyMethodDef
│ │ +    <2d3>   DW_AT_decl_file   : (data1) 13
│ │      <2d4>   DW_AT_decl_line   : (data1) 14
│ │      <2d5>   DW_AT_decl_column : (data1) 28
│ │      <2d6>   DW_AT_type        : (ref4) <0x2da>, PyMethodDef
│ │   <1><2da>: Abbrev Number: 14 (DW_TAG_structure_type)
│ │ -    <2db>   DW_AT_name        : (strp) (offset: 0x185a): PyMethodDef
│ │ +    <2db>   DW_AT_name        : (strp) (offset: 0x187f): PyMethodDef
│ │      <2df>   DW_AT_byte_size   : (data1) 32
│ │ -    <2e0>   DW_AT_decl_file   : (data1) 13
│ │ +    <2e0>   DW_AT_decl_file   : (data1) 14
│ │      <2e1>   DW_AT_decl_line   : (data1) 54
│ │      <2e2>   DW_AT_decl_column : (data1) 8
│ │      <2e3>   DW_AT_sibling     : (ref4) <0x31c>
│ │   <2><2e7>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <2e8>   DW_AT_name        : (strp) (offset: 0x2450): ml_name
│ │ -    <2ec>   DW_AT_decl_file   : (data1) 13
│ │ +    <2e8>   DW_AT_name        : (strp) (offset: 0x2491): ml_name
│ │ +    <2ec>   DW_AT_decl_file   : (data1) 14
│ │      <2ed>   DW_AT_decl_line   : (data1) 55
│ │      <2ee>   DW_AT_decl_column : (data1) 18
│ │      <2ef>   DW_AT_type        : (ref4) <0xf0>, char
│ │      <2f3>   DW_AT_data_member_location: (data1) 0
│ │   <2><2f4>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <2f5>   DW_AT_name        : (strp) (offset: 0x1394): ml_meth
│ │ -    <2f9>   DW_AT_decl_file   : (data1) 13
│ │ +    <2f5>   DW_AT_name        : (strp) (offset: 0x13b9): ml_meth
│ │ +    <2f9>   DW_AT_decl_file   : (data1) 14
│ │      <2fa>   DW_AT_decl_line   : (data1) 56
│ │      <2fb>   DW_AT_decl_column : (data1) 17
│ │      <2fc>   DW_AT_type        : (ref4) <0x19bb>, PyCFunction, PyObject, _object
│ │      <300>   DW_AT_data_member_location: (data1) 8
│ │   <2><301>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <302>   DW_AT_name        : (strp) (offset: 0x11fe): ml_flags
│ │ -    <306>   DW_AT_decl_file   : (data1) 13
│ │ +    <302>   DW_AT_name        : (strp) (offset: 0x1223): ml_flags
│ │ +    <306>   DW_AT_decl_file   : (data1) 14
│ │      <307>   DW_AT_decl_line   : (data1) 57
│ │      <308>   DW_AT_decl_column : (data1) 17
│ │      <309>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <30d>   DW_AT_data_member_location: (data1) 16
│ │   <2><30e>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <30f>   DW_AT_name        : (strp) (offset: 0x2079): ml_doc
│ │ -    <313>   DW_AT_decl_file   : (data1) 13
│ │ +    <30f>   DW_AT_name        : (strp) (offset: 0x20aa): ml_doc
│ │ +    <313>   DW_AT_decl_file   : (data1) 14
│ │      <314>   DW_AT_decl_line   : (data1) 59
│ │      <315>   DW_AT_decl_column : (data1) 18
│ │      <316>   DW_AT_type        : (ref4) <0xf0>, char
│ │      <31a>   DW_AT_data_member_location: (data1) 24
│ │   <2><31b>: Abbrev Number: 0
│ │   <1><31c>: Abbrev Number: 3 (DW_TAG_typedef)
│ │ -    <31d>   DW_AT_name        : (strp) (offset: 0x1c15): PyGetSetDef
│ │ -    <321>   DW_AT_decl_file   : (data1) 12
│ │ +    <31d>   DW_AT_name        : (strp) (offset: 0x1c46): PyGetSetDef
│ │ +    <321>   DW_AT_decl_file   : (data1) 13
│ │      <322>   DW_AT_decl_line   : (data1) 15
│ │      <323>   DW_AT_decl_column : (data1) 28
│ │      <324>   DW_AT_type        : (ref4) <0x328>, PyGetSetDef
│ │   <1><328>: Abbrev Number: 14 (DW_TAG_structure_type)
│ │ -    <329>   DW_AT_name        : (strp) (offset: 0x1c15): PyGetSetDef
│ │ +    <329>   DW_AT_name        : (strp) (offset: 0x1c46): PyGetSetDef
│ │      <32d>   DW_AT_byte_size   : (data1) 40
│ │ -    <32e>   DW_AT_decl_file   : (data1) 14
│ │ +    <32e>   DW_AT_decl_file   : (data1) 15
│ │      <32f>   DW_AT_decl_line   : (data1) 11
│ │      <330>   DW_AT_decl_column : (data1) 8
│ │      <331>   DW_AT_sibling     : (ref4) <0x377>
│ │   <2><335>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <336>   DW_AT_name        : (strp) (offset: 0x2453): name
│ │ -    <33a>   DW_AT_decl_file   : (data1) 14
│ │ +    <336>   DW_AT_name        : (strp) (offset: 0x2494): name
│ │ +    <33a>   DW_AT_decl_file   : (data1) 15
│ │      <33b>   DW_AT_decl_line   : (data1) 12
│ │      <33c>   DW_AT_decl_column : (data1) 17
│ │      <33d>   DW_AT_type        : (ref4) <0xf0>, char
│ │      <341>   DW_AT_data_member_location: (data1) 0
│ │   <2><342>: Abbrev Number: 16 (DW_TAG_member)
│ │      <343>   DW_AT_name        : (string) get
│ │ -    <347>   DW_AT_decl_file   : (data1) 14
│ │ +    <347>   DW_AT_decl_file   : (data1) 15
│ │      <348>   DW_AT_decl_line   : (data1) 13
│ │      <349>   DW_AT_decl_column : (data1) 12
│ │      <34a>   DW_AT_type        : (ref4) <0x1d9b>, getter, PyObject, _object
│ │      <34e>   DW_AT_data_member_location: (data1) 8
│ │   <2><34f>: Abbrev Number: 16 (DW_TAG_member)
│ │      <350>   DW_AT_name        : (string) set
│ │ -    <354>   DW_AT_decl_file   : (data1) 14
│ │ +    <354>   DW_AT_decl_file   : (data1) 15
│ │      <355>   DW_AT_decl_line   : (data1) 14
│ │      <356>   DW_AT_decl_column : (data1) 12
│ │      <357>   DW_AT_type        : (ref4) <0x1da7>, setter, int
│ │      <35b>   DW_AT_data_member_location: (data1) 16
│ │   <2><35c>: Abbrev Number: 16 (DW_TAG_member)
│ │      <35d>   DW_AT_name        : (string) doc
│ │ -    <361>   DW_AT_decl_file   : (data1) 14
│ │ +    <361>   DW_AT_decl_file   : (data1) 15
│ │      <362>   DW_AT_decl_line   : (data1) 15
│ │      <363>   DW_AT_decl_column : (data1) 17
│ │      <364>   DW_AT_type        : (ref4) <0xf0>, char
│ │      <368>   DW_AT_data_member_location: (data1) 24
│ │   <2><369>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <36a>   DW_AT_name        : (strp) (offset: 0xec9): closure
│ │ -    <36e>   DW_AT_decl_file   : (data1) 14
│ │ +    <36a>   DW_AT_name        : (strp) (offset: 0xeee): closure
│ │ +    <36e>   DW_AT_decl_file   : (data1) 15
│ │      <36f>   DW_AT_decl_line   : (data1) 16
│ │      <370>   DW_AT_decl_column : (data1) 11
│ │      <371>   DW_AT_type        : (ref4) <0x88>
│ │      <375>   DW_AT_data_member_location: (data1) 32
│ │   <2><376>: Abbrev Number: 0
│ │   <1><377>: Abbrev Number: 3 (DW_TAG_typedef)
│ │      <378>   DW_AT_name        : (strp) (offset: 0x940): PyMemberDef
│ │ -    <37c>   DW_AT_decl_file   : (data1) 12
│ │ +    <37c>   DW_AT_decl_file   : (data1) 13
│ │      <37d>   DW_AT_decl_line   : (data1) 16
│ │      <37e>   DW_AT_decl_column : (data1) 28
│ │      <37f>   DW_AT_type        : (ref4) <0x383>, PyMemberDef
│ │   <1><383>: Abbrev Number: 14 (DW_TAG_structure_type)
│ │      <384>   DW_AT_name        : (strp) (offset: 0x940): PyMemberDef
│ │      <388>   DW_AT_byte_size   : (data1) 40
│ │ -    <389>   DW_AT_decl_file   : (data1) 15
│ │ +    <389>   DW_AT_decl_file   : (data1) 16
│ │      <38a>   DW_AT_decl_line   : (data1) 18
│ │      <38b>   DW_AT_decl_column : (data1) 8
│ │      <38c>   DW_AT_sibling     : (ref4) <0x3d2>
│ │   <2><390>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <391>   DW_AT_name        : (strp) (offset: 0x2453): name
│ │ -    <395>   DW_AT_decl_file   : (data1) 15
│ │ +    <391>   DW_AT_name        : (strp) (offset: 0x2494): name
│ │ +    <395>   DW_AT_decl_file   : (data1) 16
│ │      <396>   DW_AT_decl_line   : (data1) 19
│ │      <397>   DW_AT_decl_column : (data1) 17
│ │      <398>   DW_AT_type        : (ref4) <0xf0>, char
│ │      <39c>   DW_AT_data_member_location: (data1) 0
│ │   <2><39d>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <39e>   DW_AT_name        : (strp) (offset: 0x21d0): type
│ │ -    <3a2>   DW_AT_decl_file   : (data1) 15
│ │ +    <39e>   DW_AT_name        : (strp) (offset: 0x2201): type
│ │ +    <3a2>   DW_AT_decl_file   : (data1) 16
│ │      <3a3>   DW_AT_decl_line   : (data1) 20
│ │      <3a4>   DW_AT_decl_column : (data1) 9
│ │      <3a5>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <3a9>   DW_AT_data_member_location: (data1) 8
│ │   <2><3aa>: Abbrev Number: 15 (DW_TAG_member)
│ │      <3ab>   DW_AT_name        : (strp) (offset: 0x902): offset
│ │ -    <3af>   DW_AT_decl_file   : (data1) 15
│ │ +    <3af>   DW_AT_decl_file   : (data1) 16
│ │      <3b0>   DW_AT_decl_line   : (data1) 21
│ │      <3b1>   DW_AT_decl_column : (data1) 16
│ │      <3b2>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
│ │      <3b6>   DW_AT_data_member_location: (data1) 16
│ │   <2><3b7>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <3b8>   DW_AT_name        : (strp) (offset: 0x1201): flags
│ │ -    <3bc>   DW_AT_decl_file   : (data1) 15
│ │ +    <3b8>   DW_AT_name        : (strp) (offset: 0x1226): flags
│ │ +    <3bc>   DW_AT_decl_file   : (data1) 16
│ │      <3bd>   DW_AT_decl_line   : (data1) 22
│ │      <3be>   DW_AT_decl_column : (data1) 9
│ │      <3bf>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <3c3>   DW_AT_data_member_location: (data1) 24
│ │   <2><3c4>: Abbrev Number: 16 (DW_TAG_member)
│ │      <3c5>   DW_AT_name        : (string) doc
│ │ -    <3c9>   DW_AT_decl_file   : (data1) 15
│ │ +    <3c9>   DW_AT_decl_file   : (data1) 16
│ │      <3ca>   DW_AT_decl_line   : (data1) 23
│ │      <3cb>   DW_AT_decl_column : (data1) 17
│ │      <3cc>   DW_AT_type        : (ref4) <0xf0>, char
│ │      <3d0>   DW_AT_data_member_location: (data1) 32
│ │   <2><3d1>: Abbrev Number: 0
│ │   <1><3d2>: Abbrev Number: 3 (DW_TAG_typedef)
│ │ -    <3d3>   DW_AT_name        : (strp) (offset: 0x13d1): PyObject
│ │ -    <3d7>   DW_AT_decl_file   : (data1) 12
│ │ +    <3d3>   DW_AT_name        : (strp) (offset: 0x13f6): PyObject
│ │ +    <3d7>   DW_AT_decl_file   : (data1) 13
│ │      <3d8>   DW_AT_decl_line   : (data1) 18
│ │      <3d9>   DW_AT_decl_column : (data1) 24
│ │      <3da>   DW_AT_type        : (ref4) <0x3de>, _object
│ │   <1><3de>: Abbrev Number: 14 (DW_TAG_structure_type)
│ │      <3df>   DW_AT_name        : (strp) (offset: 0x50b): _object
│ │      <3e3>   DW_AT_byte_size   : (data1) 16
│ │      <3e4>   DW_AT_decl_file   : (data1) 2
│ │ @@ -543,1014 +543,1014 @@
│ │      <3ec>   DW_AT_name        : (strp) (offset: 0x574): ob_refcnt
│ │      <3f0>   DW_AT_decl_file   : (data1) 2
│ │      <3f1>   DW_AT_decl_line   : (data1) 102
│ │      <3f2>   DW_AT_decl_column : (data1) 16
│ │      <3f3>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
│ │      <3f7>   DW_AT_data_member_location: (data1) 0
│ │   <2><3f8>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <3f9>   DW_AT_name        : (strp) (offset: 0x21cd): ob_type
│ │ +    <3f9>   DW_AT_name        : (strp) (offset: 0x21fe): ob_type
│ │      <3fd>   DW_AT_decl_file   : (data1) 2
│ │      <3fe>   DW_AT_decl_line   : (data1) 103
│ │      <3ff>   DW_AT_decl_column : (data1) 19
│ │      <400>   DW_AT_type        : (ref4) <0xb77>, PyTypeObject, _typeobject
│ │      <404>   DW_AT_data_member_location: (data1) 8
│ │   <2><405>: Abbrev Number: 0
│ │   <1><406>: Abbrev Number: 3 (DW_TAG_typedef)
│ │ -    <407>   DW_AT_name        : (strp) (offset: 0xd4f): PyLongObject
│ │ -    <40b>   DW_AT_decl_file   : (data1) 12
│ │ +    <407>   DW_AT_name        : (strp) (offset: 0xd68): PyLongObject
│ │ +    <40b>   DW_AT_decl_file   : (data1) 13
│ │      <40c>   DW_AT_decl_line   : (data1) 19
│ │      <40d>   DW_AT_decl_column : (data1) 28
│ │      <40e>   DW_AT_type        : (ref4) <0x412>, _longobject
│ │   <1><412>: Abbrev Number: 14 (DW_TAG_structure_type)
│ │ -    <413>   DW_AT_name        : (strp) (offset: 0x1e6c): _longobject
│ │ +    <413>   DW_AT_name        : (strp) (offset: 0x1e9d): _longobject
│ │      <417>   DW_AT_byte_size   : (data1) 32
│ │ -    <418>   DW_AT_decl_file   : (data1) 16
│ │ +    <418>   DW_AT_decl_file   : (data1) 17
│ │      <419>   DW_AT_decl_line   : (data1) 82
│ │      <41a>   DW_AT_decl_column : (data1) 8
│ │      <41b>   DW_AT_sibling     : (ref4) <0x43a>
│ │   <2><41f>: Abbrev Number: 15 (DW_TAG_member)
│ │      <420>   DW_AT_name        : (strp) (offset: 0x387): ob_base
│ │ -    <424>   DW_AT_decl_file   : (data1) 16
│ │ +    <424>   DW_AT_decl_file   : (data1) 17
│ │      <425>   DW_AT_decl_line   : (data1) 83
│ │      <426>   DW_AT_decl_column : (data1) 5
│ │      <427>   DW_AT_type        : (ref4) <0xba1>, PyVarObject
│ │      <42b>   DW_AT_data_member_location: (data1) 0
│ │   <2><42c>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <42d>   DW_AT_name        : (strp) (offset: 0xb2f): ob_digit
│ │ -    <431>   DW_AT_decl_file   : (data1) 16
│ │ +    <42d>   DW_AT_name        : (strp) (offset: 0xb34): ob_digit
│ │ +    <431>   DW_AT_decl_file   : (data1) 17
│ │      <432>   DW_AT_decl_line   : (data1) 84
│ │      <433>   DW_AT_decl_column : (data1) 11
│ │      <434>   DW_AT_type        : (ref4) <0x1772>, digit, uint32_t, unsigned int
│ │      <438>   DW_AT_data_member_location: (data1) 24
│ │   <2><439>: Abbrev Number: 0
│ │   <1><43a>: Abbrev Number: 3 (DW_TAG_typedef)
│ │ -    <43b>   DW_AT_name        : (strp) (offset: 0xae1): PyTypeObject
│ │ -    <43f>   DW_AT_decl_file   : (data1) 12
│ │ +    <43b>   DW_AT_name        : (strp) (offset: 0xae6): PyTypeObject
│ │ +    <43f>   DW_AT_decl_file   : (data1) 13
│ │      <440>   DW_AT_decl_line   : (data1) 20
│ │      <441>   DW_AT_decl_column : (data1) 28
│ │      <442>   DW_AT_type        : (ref4) <0x446>, _typeobject
│ │   <1><446>: Abbrev Number: 17 (DW_TAG_structure_type)
│ │ -    <447>   DW_AT_name        : (strp) (offset: 0x10b8): _typeobject
│ │ +    <447>   DW_AT_name        : (strp) (offset: 0x10dd): _typeobject
│ │      <44b>   DW_AT_byte_size   : (data2) 408
│ │ -    <44d>   DW_AT_decl_file   : (data1) 17
│ │ +    <44d>   DW_AT_decl_file   : (data1) 18
│ │      <44e>   DW_AT_decl_line   : (data1) 148
│ │      <44f>   DW_AT_decl_column : (data1) 8
│ │      <450>   DW_AT_sibling     : (ref4) <0x6e5>
│ │   <2><454>: Abbrev Number: 15 (DW_TAG_member)
│ │      <455>   DW_AT_name        : (strp) (offset: 0x387): ob_base
│ │ -    <459>   DW_AT_decl_file   : (data1) 17
│ │ +    <459>   DW_AT_decl_file   : (data1) 18
│ │      <45a>   DW_AT_decl_line   : (data1) 149
│ │      <45b>   DW_AT_decl_column : (data1) 5
│ │      <45c>   DW_AT_type        : (ref4) <0xba1>, PyVarObject
│ │      <460>   DW_AT_data_member_location: (data1) 0
│ │   <2><461>: Abbrev Number: 15 (DW_TAG_member)
│ │      <462>   DW_AT_name        : (strp) (offset: 0x4b3): tp_name
│ │ -    <466>   DW_AT_decl_file   : (data1) 17
│ │ +    <466>   DW_AT_decl_file   : (data1) 18
│ │      <467>   DW_AT_decl_line   : (data1) 150
│ │      <468>   DW_AT_decl_column : (data1) 17
│ │      <469>   DW_AT_type        : (ref4) <0xf0>, char
│ │      <46d>   DW_AT_data_member_location: (data1) 24
│ │   <2><46e>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <46f>   DW_AT_name        : (strp) (offset: 0x1d2a): tp_basicsize
│ │ -    <473>   DW_AT_decl_file   : (data1) 17
│ │ +    <46f>   DW_AT_name        : (strp) (offset: 0x1d5b): tp_basicsize
│ │ +    <473>   DW_AT_decl_file   : (data1) 18
│ │      <474>   DW_AT_decl_line   : (data1) 151
│ │      <475>   DW_AT_decl_column : (data1) 16
│ │      <476>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
│ │      <47a>   DW_AT_data_member_location: (data1) 32
│ │   <2><47b>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <47c>   DW_AT_name        : (strp) (offset: 0x1e1b): tp_itemsize
│ │ -    <480>   DW_AT_decl_file   : (data1) 17
│ │ +    <47c>   DW_AT_name        : (strp) (offset: 0x1e4c): tp_itemsize
│ │ +    <480>   DW_AT_decl_file   : (data1) 18
│ │      <481>   DW_AT_decl_line   : (data1) 151
│ │      <482>   DW_AT_decl_column : (data1) 30
│ │      <483>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
│ │      <487>   DW_AT_data_member_location: (data1) 40
│ │   <2><488>: Abbrev Number: 15 (DW_TAG_member)
│ │      <489>   DW_AT_name        : (strp) (offset: 0x18e): tp_dealloc
│ │ -    <48d>   DW_AT_decl_file   : (data1) 17
│ │ +    <48d>   DW_AT_decl_file   : (data1) 18
│ │      <48e>   DW_AT_decl_line   : (data1) 155
│ │      <48f>   DW_AT_decl_column : (data1) 16
│ │      <490>   DW_AT_type        : (ref4) <0xd71>, destructor
│ │      <494>   DW_AT_data_member_location: (data1) 48
│ │   <2><495>: Abbrev Number: 15 (DW_TAG_member)
│ │      <496>   DW_AT_name        : (strp) (offset: 0x8f4): tp_vectorcall_offset
│ │ -    <49a>   DW_AT_decl_file   : (data1) 17
│ │ +    <49a>   DW_AT_decl_file   : (data1) 18
│ │      <49b>   DW_AT_decl_line   : (data1) 156
│ │      <49c>   DW_AT_decl_column : (data1) 16
│ │      <49d>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
│ │      <4a1>   DW_AT_data_member_location: (data1) 56
│ │   <2><4a2>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <4a3>   DW_AT_name        : (strp) (offset: 0x1ca3): tp_getattr
│ │ -    <4a7>   DW_AT_decl_file   : (data1) 17
│ │ +    <4a3>   DW_AT_name        : (strp) (offset: 0x1cd4): tp_getattr
│ │ +    <4a7>   DW_AT_decl_file   : (data1) 18
│ │      <4a8>   DW_AT_decl_line   : (data1) 157
│ │      <4a9>   DW_AT_decl_column : (data1) 17
│ │      <4aa>   DW_AT_type        : (ref4) <0xd8e>, getattrfunc, PyObject, _object
│ │      <4ae>   DW_AT_data_member_location: (data1) 64
│ │   <2><4af>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <4b0>   DW_AT_name        : (strp) (offset: 0xe0e): tp_setattr
│ │ -    <4b4>   DW_AT_decl_file   : (data1) 17
│ │ +    <4b0>   DW_AT_name        : (strp) (offset: 0xe27): tp_setattr
│ │ +    <4b4>   DW_AT_decl_file   : (data1) 18
│ │      <4b5>   DW_AT_decl_line   : (data1) 158
│ │      <4b6>   DW_AT_decl_column : (data1) 17
│ │      <4b7>   DW_AT_type        : (ref4) <0xdc0>, setattrfunc, int
│ │      <4bb>   DW_AT_data_member_location: (data1) 72
│ │   <2><4bc>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <4bd>   DW_AT_name        : (strp) (offset: 0x19b6): tp_as_async
│ │ -    <4c1>   DW_AT_decl_file   : (data1) 17
│ │ +    <4bd>   DW_AT_name        : (strp) (offset: 0x19db): tp_as_async
│ │ +    <4c1>   DW_AT_decl_file   : (data1) 18
│ │      <4c2>   DW_AT_decl_line   : (data1) 159
│ │      <4c3>   DW_AT_decl_column : (data1) 21
│ │      <4c4>   DW_AT_type        : (ref4) <0x13d1>, PyAsyncMethods
│ │      <4c8>   DW_AT_data_member_location: (data1) 80
│ │   <2><4c9>: Abbrev Number: 15 (DW_TAG_member)
│ │      <4ca>   DW_AT_name        : (strp) (offset: 0x214): tp_repr
│ │ -    <4ce>   DW_AT_decl_file   : (data1) 17
│ │ +    <4ce>   DW_AT_decl_file   : (data1) 18
│ │      <4cf>   DW_AT_decl_line   : (data1) 161
│ │      <4d0>   DW_AT_decl_column : (data1) 14
│ │      <4d1>   DW_AT_type        : (ref4) <0xdf7>, reprfunc, PyObject, _object
│ │      <4d5>   DW_AT_data_member_location: (data1) 88
│ │   <2><4d6>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <4d7>   DW_AT_name        : (strp) (offset: 0x1f2b): tp_as_number
│ │ -    <4db>   DW_AT_decl_file   : (data1) 17
│ │ +    <4d7>   DW_AT_name        : (strp) (offset: 0x1f5c): tp_as_number
│ │ +    <4db>   DW_AT_decl_file   : (data1) 18
│ │      <4dc>   DW_AT_decl_line   : (data1) 165
│ │      <4dd>   DW_AT_decl_column : (data1) 22
│ │      <4de>   DW_AT_type        : (ref4) <0x13d7>, PyNumberMethods
│ │      <4e2>   DW_AT_data_member_location: (data1) 96
│ │   <2><4e3>: Abbrev Number: 15 (DW_TAG_member)
│ │      <4e4>   DW_AT_name        : (strp) (offset: 0x205): tp_as_sequence
│ │ -    <4e8>   DW_AT_decl_file   : (data1) 17
│ │ +    <4e8>   DW_AT_decl_file   : (data1) 18
│ │      <4e9>   DW_AT_decl_line   : (data1) 166
│ │      <4ea>   DW_AT_decl_column : (data1) 24
│ │      <4eb>   DW_AT_type        : (ref4) <0x13dd>, PySequenceMethods
│ │      <4ef>   DW_AT_data_member_location: (data1) 104
│ │   <2><4f0>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <4f1>   DW_AT_name        : (strp) (offset: 0xdd8): tp_as_mapping
│ │ -    <4f5>   DW_AT_decl_file   : (data1) 17
│ │ +    <4f1>   DW_AT_name        : (strp) (offset: 0xdf1): tp_as_mapping
│ │ +    <4f5>   DW_AT_decl_file   : (data1) 18
│ │      <4f6>   DW_AT_decl_line   : (data1) 167
│ │      <4f7>   DW_AT_decl_column : (data1) 23
│ │      <4f8>   DW_AT_type        : (ref4) <0x13e3>, PyMappingMethods
│ │      <4fc>   DW_AT_data_member_location: (data1) 112
│ │   <2><4fd>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <4fe>   DW_AT_name        : (strp) (offset: 0xa0c): tp_hash
│ │ -    <502>   DW_AT_decl_file   : (data1) 17
│ │ +    <4fe>   DW_AT_name        : (strp) (offset: 0xa19): tp_hash
│ │ +    <502>   DW_AT_decl_file   : (data1) 18
│ │      <503>   DW_AT_decl_line   : (data1) 171
│ │      <504>   DW_AT_decl_column : (data1) 14
│ │      <505>   DW_AT_type        : (ref4) <0xe03>, hashfunc, Py_hash_t, Py_ssize_t, ssize_t, long int
│ │      <509>   DW_AT_data_member_location: (data1) 120
│ │   <2><50a>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <50b>   DW_AT_name        : (strp) (offset: 0x143f): tp_call
│ │ -    <50f>   DW_AT_decl_file   : (data1) 17
│ │ +    <50b>   DW_AT_name        : (strp) (offset: 0x1464): tp_call
│ │ +    <50f>   DW_AT_decl_file   : (data1) 18
│ │      <510>   DW_AT_decl_line   : (data1) 172
│ │      <511>   DW_AT_decl_column : (data1) 17
│ │      <512>   DW_AT_type        : (ref4) <0xbf4>, ternaryfunc, PyObject, _object
│ │      <516>   DW_AT_data_member_location: (data1) 128
│ │   <2><517>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <518>   DW_AT_name        : (strp) (offset: 0xef8): tp_str
│ │ -    <51c>   DW_AT_decl_file   : (data1) 17
│ │ +    <518>   DW_AT_name        : (strp) (offset: 0xf1d): tp_str
│ │ +    <51c>   DW_AT_decl_file   : (data1) 18
│ │      <51d>   DW_AT_decl_line   : (data1) 173
│ │      <51e>   DW_AT_decl_column : (data1) 14
│ │      <51f>   DW_AT_type        : (ref4) <0xdf7>, reprfunc, PyObject, _object
│ │      <523>   DW_AT_data_member_location: (data1) 136
│ │   <2><524>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <525>   DW_AT_name        : (strp) (offset: 0xb77): tp_getattro
│ │ -    <529>   DW_AT_decl_file   : (data1) 17
│ │ +    <525>   DW_AT_name        : (strp) (offset: 0xb7c): tp_getattro
│ │ +    <529>   DW_AT_decl_file   : (data1) 18
│ │      <52a>   DW_AT_decl_line   : (data1) 174
│ │      <52b>   DW_AT_decl_column : (data1) 18
│ │      <52c>   DW_AT_type        : (ref4) <0xdb4>, getattrofunc, PyObject, _object
│ │      <530>   DW_AT_data_member_location: (data1) 144
│ │   <2><531>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <532>   DW_AT_name        : (strp) (offset: 0x1769): tp_setattro
│ │ -    <536>   DW_AT_decl_file   : (data1) 17
│ │ +    <532>   DW_AT_name        : (strp) (offset: 0x178e): tp_setattro
│ │ +    <536>   DW_AT_decl_file   : (data1) 18
│ │      <537>   DW_AT_decl_line   : (data1) 175
│ │      <538>   DW_AT_decl_column : (data1) 18
│ │      <539>   DW_AT_type        : (ref4) <0xdeb>, setattrofunc, int
│ │      <53d>   DW_AT_data_member_location: (data1) 152
│ │   <2><53e>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <53f>   DW_AT_name        : (strp) (offset: 0x1b8f): tp_as_buffer
│ │ -    <543>   DW_AT_decl_file   : (data1) 17
│ │ +    <53f>   DW_AT_name        : (strp) (offset: 0x1bc0): tp_as_buffer
│ │ +    <543>   DW_AT_decl_file   : (data1) 18
│ │      <544>   DW_AT_decl_line   : (data1) 178
│ │      <545>   DW_AT_decl_column : (data1) 20
│ │      <546>   DW_AT_type        : (ref4) <0x13e9>, PyBufferProcs
│ │      <54a>   DW_AT_data_member_location: (data1) 160
│ │   <2><54b>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <54c>   DW_AT_name        : (strp) (offset: 0x1106): tp_flags
│ │ -    <550>   DW_AT_decl_file   : (data1) 17
│ │ +    <54c>   DW_AT_name        : (strp) (offset: 0x112b): tp_flags
│ │ +    <550>   DW_AT_decl_file   : (data1) 18
│ │      <551>   DW_AT_decl_line   : (data1) 181
│ │      <552>   DW_AT_decl_column : (data1) 19
│ │      <553>   DW_AT_type        : (ref4) <0x62>, long unsigned int
│ │      <557>   DW_AT_data_member_location: (data1) 168
│ │   <2><558>: Abbrev Number: 15 (DW_TAG_member)
│ │      <559>   DW_AT_name        : (strp) (offset: 0x76c): tp_doc
│ │ -    <55d>   DW_AT_decl_file   : (data1) 17
│ │ +    <55d>   DW_AT_decl_file   : (data1) 18
│ │      <55e>   DW_AT_decl_line   : (data1) 183
│ │      <55f>   DW_AT_decl_column : (data1) 17
│ │      <560>   DW_AT_type        : (ref4) <0xf0>, char
│ │      <564>   DW_AT_data_member_location: (data1) 176
│ │   <2><565>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <566>   DW_AT_name        : (strp) (offset: 0xd43): tp_traverse
│ │ -    <56a>   DW_AT_decl_file   : (data1) 17
│ │ +    <566>   DW_AT_name        : (strp) (offset: 0xd5c): tp_traverse
│ │ +    <56a>   DW_AT_decl_file   : (data1) 18
│ │      <56b>   DW_AT_decl_line   : (data1) 187
│ │      <56c>   DW_AT_decl_column : (data1) 18
│ │      <56d>   DW_AT_type        : (ref4) <0xd29>, traverseproc, int
│ │      <571>   DW_AT_data_member_location: (data1) 184
│ │   <2><572>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <573>   DW_AT_name        : (strp) (offset: 0x1423): tp_clear
│ │ -    <577>   DW_AT_decl_file   : (data1) 17
│ │ +    <573>   DW_AT_name        : (strp) (offset: 0x1448): tp_clear
│ │ +    <577>   DW_AT_decl_file   : (data1) 18
│ │      <578>   DW_AT_decl_line   : (data1) 190
│ │      <579>   DW_AT_decl_column : (data1) 13
│ │      <57a>   DW_AT_type        : (ref4) <0xc1f>, inquiry, int
│ │      <57e>   DW_AT_data_member_location: (data1) 192
│ │   <2><57f>: Abbrev Number: 15 (DW_TAG_member)
│ │      <580>   DW_AT_name        : (strp) (offset: 0x140): tp_richcompare
│ │ -    <584>   DW_AT_decl_file   : (data1) 17
│ │ +    <584>   DW_AT_decl_file   : (data1) 18
│ │      <585>   DW_AT_decl_line   : (data1) 194
│ │      <586>   DW_AT_decl_column : (data1) 17
│ │      <587>   DW_AT_type        : (ref4) <0xe24>, richcmpfunc, PyObject, _object
│ │      <58b>   DW_AT_data_member_location: (data1) 200
│ │   <2><58c>: Abbrev Number: 15 (DW_TAG_member)
│ │      <58d>   DW_AT_name        : (strp) (offset: 0x479): tp_weaklistoffset
│ │ -    <591>   DW_AT_decl_file   : (data1) 17
│ │ +    <591>   DW_AT_decl_file   : (data1) 18
│ │      <592>   DW_AT_decl_line   : (data1) 197
│ │      <593>   DW_AT_decl_column : (data1) 16
│ │      <594>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
│ │      <598>   DW_AT_data_member_location: (data1) 208
│ │   <2><599>: Abbrev Number: 15 (DW_TAG_member)
│ │      <59a>   DW_AT_name        : (strp) (offset: 0x611): tp_iter
│ │ -    <59e>   DW_AT_decl_file   : (data1) 17
│ │ +    <59e>   DW_AT_decl_file   : (data1) 18
│ │      <59f>   DW_AT_decl_line   : (data1) 200
│ │      <5a0>   DW_AT_decl_column : (data1) 17
│ │      <5a1>   DW_AT_type        : (ref4) <0xe4f>, getiterfunc, PyObject, _object
│ │      <5a5>   DW_AT_data_member_location: (data1) 216
│ │   <2><5a6>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <5a7>   DW_AT_name        : (strp) (offset: 0x1417): tp_iternext
│ │ -    <5ab>   DW_AT_decl_file   : (data1) 17
│ │ +    <5a7>   DW_AT_name        : (strp) (offset: 0x143c): tp_iternext
│ │ +    <5ab>   DW_AT_decl_file   : (data1) 18
│ │      <5ac>   DW_AT_decl_line   : (data1) 201
│ │      <5ad>   DW_AT_decl_column : (data1) 18
│ │      <5ae>   DW_AT_type        : (ref4) <0xe5b>, iternextfunc, PyObject, _object
│ │      <5b2>   DW_AT_data_member_location: (data1) 224
│ │   <2><5b3>: Abbrev Number: 15 (DW_TAG_member)
│ │      <5b4>   DW_AT_name        : (strp) (offset: 0x35f): tp_methods
│ │ -    <5b8>   DW_AT_decl_file   : (data1) 17
│ │ +    <5b8>   DW_AT_decl_file   : (data1) 18
│ │      <5b9>   DW_AT_decl_line   : (data1) 204
│ │      <5ba>   DW_AT_decl_column : (data1) 18
│ │      <5bb>   DW_AT_type        : (ref4) <0x13ef>, PyMethodDef, PyMethodDef
│ │      <5bf>   DW_AT_data_member_location: (data1) 232
│ │   <2><5c0>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <5c1>   DW_AT_name        : (strp) (offset: 0x15f4): tp_members
│ │ -    <5c5>   DW_AT_decl_file   : (data1) 17
│ │ +    <5c1>   DW_AT_name        : (strp) (offset: 0x1619): tp_members
│ │ +    <5c5>   DW_AT_decl_file   : (data1) 18
│ │      <5c6>   DW_AT_decl_line   : (data1) 205
│ │      <5c7>   DW_AT_decl_column : (data1) 18
│ │      <5c8>   DW_AT_type        : (ref4) <0x13f5>, PyMemberDef, PyMemberDef
│ │      <5cc>   DW_AT_data_member_location: (data1) 240
│ │   <2><5cd>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <5ce>   DW_AT_name        : (strp) (offset: 0x1b2c): tp_getset
│ │ -    <5d2>   DW_AT_decl_file   : (data1) 17
│ │ +    <5ce>   DW_AT_name        : (strp) (offset: 0x1b5d): tp_getset
│ │ +    <5d2>   DW_AT_decl_file   : (data1) 18
│ │      <5d3>   DW_AT_decl_line   : (data1) 206
│ │      <5d4>   DW_AT_decl_column : (data1) 18
│ │      <5d5>   DW_AT_type        : (ref4) <0x13fb>, PyGetSetDef, PyGetSetDef
│ │      <5d9>   DW_AT_data_member_location: (data1) 248
│ │   <2><5da>: Abbrev Number: 18 (DW_TAG_member)
│ │      <5db>   DW_AT_name        : (strp) (offset: 0x8db): tp_base
│ │ -    <5df>   DW_AT_decl_file   : (data1) 17
│ │ +    <5df>   DW_AT_decl_file   : (data1) 18
│ │      <5e0>   DW_AT_decl_line   : (data1) 208
│ │      <5e1>   DW_AT_decl_column : (data1) 19
│ │      <5e2>   DW_AT_type        : (ref4) <0xb77>, PyTypeObject, _typeobject
│ │      <5e6>   DW_AT_data_member_location: (data2) 256
│ │   <2><5e8>: Abbrev Number: 18 (DW_TAG_member)
│ │ -    <5e9>   DW_AT_name        : (strp) (offset: 0xccd): tp_dict
│ │ -    <5ed>   DW_AT_decl_file   : (data1) 17
│ │ +    <5e9>   DW_AT_name        : (strp) (offset: 0xcdd): tp_dict
│ │ +    <5ed>   DW_AT_decl_file   : (data1) 18
│ │      <5ee>   DW_AT_decl_line   : (data1) 209
│ │      <5ef>   DW_AT_decl_column : (data1) 15
│ │      <5f0>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <5f4>   DW_AT_data_member_location: (data2) 264
│ │   <2><5f6>: Abbrev Number: 18 (DW_TAG_member)
│ │ -    <5f7>   DW_AT_name        : (strp) (offset: 0x224f): tp_descr_get
│ │ -    <5fb>   DW_AT_decl_file   : (data1) 17
│ │ +    <5f7>   DW_AT_name        : (strp) (offset: 0x2290): tp_descr_get
│ │ +    <5fb>   DW_AT_decl_file   : (data1) 18
│ │      <5fc>   DW_AT_decl_line   : (data1) 210
│ │      <5fd>   DW_AT_decl_column : (data1) 18
│ │      <5fe>   DW_AT_type        : (ref4) <0xe67>, descrgetfunc, PyObject, _object
│ │      <602>   DW_AT_data_member_location: (data2) 272
│ │   <2><604>: Abbrev Number: 18 (DW_TAG_member)
│ │ -    <605>   DW_AT_name        : (strp) (offset: 0xc51): tp_descr_set
│ │ -    <609>   DW_AT_decl_file   : (data1) 17
│ │ +    <605>   DW_AT_name        : (strp) (offset: 0xc56): tp_descr_set
│ │ +    <609>   DW_AT_decl_file   : (data1) 18
│ │      <60a>   DW_AT_decl_line   : (data1) 211
│ │      <60b>   DW_AT_decl_column : (data1) 18
│ │      <60c>   DW_AT_type        : (ref4) <0xe73>, descrsetfunc, int
│ │      <610>   DW_AT_data_member_location: (data2) 280
│ │   <2><612>: Abbrev Number: 18 (DW_TAG_member)
│ │ -    <613>   DW_AT_name        : (strp) (offset: 0x2464): tp_dictoffset
│ │ -    <617>   DW_AT_decl_file   : (data1) 17
│ │ +    <613>   DW_AT_name        : (strp) (offset: 0x24a5): tp_dictoffset
│ │ +    <617>   DW_AT_decl_file   : (data1) 18
│ │      <618>   DW_AT_decl_line   : (data1) 212
│ │      <619>   DW_AT_decl_column : (data1) 16
│ │      <61a>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
│ │      <61e>   DW_AT_data_member_location: (data2) 288
│ │   <2><620>: Abbrev Number: 18 (DW_TAG_member)
│ │      <621>   DW_AT_name        : (strp) (offset: 0x38f): tp_init
│ │ -    <625>   DW_AT_decl_file   : (data1) 17
│ │ +    <625>   DW_AT_decl_file   : (data1) 18
│ │      <626>   DW_AT_decl_line   : (data1) 213
│ │      <627>   DW_AT_decl_column : (data1) 14
│ │      <628>   DW_AT_type        : (ref4) <0xe7f>, initproc, int
│ │      <62c>   DW_AT_data_member_location: (data2) 296
│ │   <2><62e>: Abbrev Number: 18 (DW_TAG_member)
│ │ -    <62f>   DW_AT_name        : (strp) (offset: 0x19e9): tp_alloc
│ │ -    <633>   DW_AT_decl_file   : (data1) 17
│ │ +    <62f>   DW_AT_name        : (strp) (offset: 0x1a0e): tp_alloc
│ │ +    <633>   DW_AT_decl_file   : (data1) 18
│ │      <634>   DW_AT_decl_line   : (data1) 214
│ │      <635>   DW_AT_decl_column : (data1) 15
│ │      <636>   DW_AT_type        : (ref4) <0xeb6>, allocfunc, PyObject, _object
│ │      <63a>   DW_AT_data_member_location: (data2) 304
│ │   <2><63c>: Abbrev Number: 18 (DW_TAG_member)
│ │ -    <63d>   DW_AT_name        : (strp) (offset: 0x21b5): tp_new
│ │ -    <641>   DW_AT_decl_file   : (data1) 17
│ │ +    <63d>   DW_AT_name        : (strp) (offset: 0x21e6): tp_new
│ │ +    <641>   DW_AT_decl_file   : (data1) 18
│ │      <642>   DW_AT_decl_line   : (data1) 215
│ │      <643>   DW_AT_decl_column : (data1) 13
│ │      <644>   DW_AT_type        : (ref4) <0xe8b>, newfunc, PyObject, _object
│ │      <648>   DW_AT_data_member_location: (data2) 312
│ │   <2><64a>: Abbrev Number: 18 (DW_TAG_member)
│ │      <64b>   DW_AT_name        : (strp) (offset: 0x878): tp_free
│ │ -    <64f>   DW_AT_decl_file   : (data1) 17
│ │ +    <64f>   DW_AT_decl_file   : (data1) 18
│ │      <650>   DW_AT_decl_line   : (data1) 216
│ │      <651>   DW_AT_decl_column : (data1) 14
│ │      <652>   DW_AT_type        : (ref4) <0xd54>, freefunc
│ │      <656>   DW_AT_data_member_location: (data2) 320
│ │   <2><658>: Abbrev Number: 18 (DW_TAG_member)
│ │      <659>   DW_AT_name        : (strp) (offset: 0x48b): tp_is_gc
│ │ -    <65d>   DW_AT_decl_file   : (data1) 17
│ │ +    <65d>   DW_AT_decl_file   : (data1) 18
│ │      <65e>   DW_AT_decl_line   : (data1) 217
│ │      <65f>   DW_AT_decl_column : (data1) 13
│ │      <660>   DW_AT_type        : (ref4) <0xc1f>, inquiry, int
│ │      <664>   DW_AT_data_member_location: (data2) 328
│ │   <2><666>: Abbrev Number: 18 (DW_TAG_member)
│ │      <667>   DW_AT_name        : (strp) (offset: 0x345): tp_bases
│ │ -    <66b>   DW_AT_decl_file   : (data1) 17
│ │ +    <66b>   DW_AT_decl_file   : (data1) 18
│ │      <66c>   DW_AT_decl_line   : (data1) 218
│ │      <66d>   DW_AT_decl_column : (data1) 15
│ │      <66e>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <672>   DW_AT_data_member_location: (data2) 336
│ │   <2><674>: Abbrev Number: 18 (DW_TAG_member)
│ │      <675>   DW_AT_name        : (strp) (offset: 0x51a): tp_mro
│ │ -    <679>   DW_AT_decl_file   : (data1) 17
│ │ +    <679>   DW_AT_decl_file   : (data1) 18
│ │      <67a>   DW_AT_decl_line   : (data1) 219
│ │      <67b>   DW_AT_decl_column : (data1) 15
│ │      <67c>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <680>   DW_AT_data_member_location: (data2) 344
│ │   <2><682>: Abbrev Number: 18 (DW_TAG_member)
│ │ -    <683>   DW_AT_name        : (strp) (offset: 0x1d21): tp_cache
│ │ -    <687>   DW_AT_decl_file   : (data1) 17
│ │ +    <683>   DW_AT_name        : (strp) (offset: 0x1d52): tp_cache
│ │ +    <687>   DW_AT_decl_file   : (data1) 18
│ │      <688>   DW_AT_decl_line   : (data1) 220
│ │      <689>   DW_AT_decl_column : (data1) 15
│ │      <68a>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <68e>   DW_AT_data_member_location: (data2) 352
│ │   <2><690>: Abbrev Number: 18 (DW_TAG_member)
│ │ -    <691>   DW_AT_name        : (strp) (offset: 0x23d8): tp_subclasses
│ │ -    <695>   DW_AT_decl_file   : (data1) 17
│ │ +    <691>   DW_AT_name        : (strp) (offset: 0x2419): tp_subclasses
│ │ +    <695>   DW_AT_decl_file   : (data1) 18
│ │      <696>   DW_AT_decl_line   : (data1) 221
│ │      <697>   DW_AT_decl_column : (data1) 15
│ │      <698>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <69c>   DW_AT_data_member_location: (data2) 360
│ │   <2><69e>: Abbrev Number: 18 (DW_TAG_member)
│ │ -    <69f>   DW_AT_name        : (strp) (offset: 0x1b5b): tp_weaklist
│ │ -    <6a3>   DW_AT_decl_file   : (data1) 17
│ │ +    <69f>   DW_AT_name        : (strp) (offset: 0x1b8c): tp_weaklist
│ │ +    <6a3>   DW_AT_decl_file   : (data1) 18
│ │      <6a4>   DW_AT_decl_line   : (data1) 222
│ │      <6a5>   DW_AT_decl_column : (data1) 15
│ │      <6a6>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <6aa>   DW_AT_data_member_location: (data2) 368
│ │   <2><6ac>: Abbrev Number: 18 (DW_TAG_member)
│ │ -    <6ad>   DW_AT_name        : (strp) (offset: 0x2112): tp_del
│ │ -    <6b1>   DW_AT_decl_file   : (data1) 17
│ │ +    <6ad>   DW_AT_name        : (strp) (offset: 0x2143): tp_del
│ │ +    <6b1>   DW_AT_decl_file   : (data1) 18
│ │      <6b2>   DW_AT_decl_line   : (data1) 223
│ │      <6b3>   DW_AT_decl_column : (data1) 16
│ │      <6b4>   DW_AT_type        : (ref4) <0xd71>, destructor
│ │      <6b8>   DW_AT_data_member_location: (data2) 376
│ │   <2><6ba>: Abbrev Number: 18 (DW_TAG_member)
│ │ -    <6bb>   DW_AT_name        : (strp) (offset: 0x1c7e): tp_version_tag
│ │ -    <6bf>   DW_AT_decl_file   : (data1) 17
│ │ +    <6bb>   DW_AT_name        : (strp) (offset: 0x1caf): tp_version_tag
│ │ +    <6bf>   DW_AT_decl_file   : (data1) 18
│ │      <6c0>   DW_AT_decl_line   : (data1) 226
│ │      <6c1>   DW_AT_decl_column : (data1) 18
│ │      <6c2>   DW_AT_type        : (ref4) <0x7c>, unsigned int
│ │      <6c6>   DW_AT_data_member_location: (data2) 384
│ │   <2><6c8>: Abbrev Number: 18 (DW_TAG_member)
│ │ -    <6c9>   DW_AT_name        : (strp) (offset: 0x2024): tp_finalize
│ │ -    <6cd>   DW_AT_decl_file   : (data1) 17
│ │ +    <6c9>   DW_AT_name        : (strp) (offset: 0x2055): tp_finalize
│ │ +    <6cd>   DW_AT_decl_file   : (data1) 18
│ │      <6ce>   DW_AT_decl_line   : (data1) 228
│ │      <6cf>   DW_AT_decl_column : (data1) 16
│ │      <6d0>   DW_AT_type        : (ref4) <0xd71>, destructor
│ │      <6d4>   DW_AT_data_member_location: (data2) 392
│ │   <2><6d6>: Abbrev Number: 18 (DW_TAG_member)
│ │ -    <6d7>   DW_AT_name        : (strp) (offset: 0x1bbe): tp_vectorcall
│ │ -    <6db>   DW_AT_decl_file   : (data1) 17
│ │ +    <6d7>   DW_AT_name        : (strp) (offset: 0x1bef): tp_vectorcall
│ │ +    <6db>   DW_AT_decl_file   : (data1) 18
│ │      <6dc>   DW_AT_decl_line   : (data1) 229
│ │      <6dd>   DW_AT_decl_column : (data1) 20
│ │      <6de>   DW_AT_type        : (ref4) <0x102c>, vectorcallfunc, PyObject, _object
│ │      <6e2>   DW_AT_data_member_location: (data2) 400
│ │   <2><6e4>: Abbrev Number: 0
│ │   <1><6e5>: Abbrev Number: 3 (DW_TAG_typedef)
│ │ -    <6e6>   DW_AT_name        : (strp) (offset: 0xd05): PyCodeObject
│ │ -    <6ea>   DW_AT_decl_file   : (data1) 12
│ │ +    <6e6>   DW_AT_name        : (strp) (offset: 0xd1e): PyCodeObject
│ │ +    <6ea>   DW_AT_decl_file   : (data1) 13
│ │      <6eb>   DW_AT_decl_line   : (data1) 21
│ │      <6ec>   DW_AT_decl_column : (data1) 29
│ │      <6ed>   DW_AT_type        : (ref4) <0x6f1>, PyCodeObject
│ │   <1><6f1>: Abbrev Number: 14 (DW_TAG_structure_type)
│ │ -    <6f2>   DW_AT_name        : (strp) (offset: 0xd05): PyCodeObject
│ │ +    <6f2>   DW_AT_name        : (strp) (offset: 0xd1e): PyCodeObject
│ │      <6f6>   DW_AT_byte_size   : (data1) 192
│ │ -    <6f7>   DW_AT_decl_file   : (data1) 18
│ │ +    <6f7>   DW_AT_decl_file   : (data1) 19
│ │      <6f8>   DW_AT_decl_line   : (data1) 103
│ │      <6f9>   DW_AT_decl_column : (data1) 8
│ │      <6fa>   DW_AT_sibling     : (ref4) <0x878>
│ │   <2><6fe>: Abbrev Number: 15 (DW_TAG_member)
│ │      <6ff>   DW_AT_name        : (strp) (offset: 0x387): ob_base
│ │ -    <703>   DW_AT_decl_file   : (data1) 18
│ │ +    <703>   DW_AT_decl_file   : (data1) 19
│ │      <704>   DW_AT_decl_line   : (data1) 103
│ │      <705>   DW_AT_decl_column : (data1) 21
│ │      <706>   DW_AT_type        : (ref4) <0xba1>, PyVarObject
│ │      <70a>   DW_AT_data_member_location: (data1) 0
│ │   <2><70b>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <70c>   DW_AT_name        : (strp) (offset: 0x1129): co_consts
│ │ -    <710>   DW_AT_decl_file   : (data1) 18
│ │ +    <70c>   DW_AT_name        : (strp) (offset: 0x114e): co_consts
│ │ +    <710>   DW_AT_decl_file   : (data1) 19
│ │      <711>   DW_AT_decl_line   : (data1) 103
│ │      <712>   DW_AT_decl_column : (data1) 21
│ │      <713>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <717>   DW_AT_data_member_location: (data1) 24
│ │   <2><718>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <719>   DW_AT_name        : (strp) (offset: 0x12b4): co_names
│ │ -    <71d>   DW_AT_decl_file   : (data1) 18
│ │ +    <719>   DW_AT_name        : (strp) (offset: 0x12d9): co_names
│ │ +    <71d>   DW_AT_decl_file   : (data1) 19
│ │      <71e>   DW_AT_decl_line   : (data1) 103
│ │      <71f>   DW_AT_decl_column : (data1) 21
│ │      <720>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <724>   DW_AT_data_member_location: (data1) 32
│ │   <2><725>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <726>   DW_AT_name        : (strp) (offset: 0xd31): co_exceptiontable
│ │ -    <72a>   DW_AT_decl_file   : (data1) 18
│ │ +    <726>   DW_AT_name        : (strp) (offset: 0xd4a): co_exceptiontable
│ │ +    <72a>   DW_AT_decl_file   : (data1) 19
│ │      <72b>   DW_AT_decl_line   : (data1) 103
│ │      <72c>   DW_AT_decl_column : (data1) 21
│ │      <72d>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <731>   DW_AT_data_member_location: (data1) 40
│ │   <2><732>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <733>   DW_AT_name        : (strp) (offset: 0x22c3): co_flags
│ │ -    <737>   DW_AT_decl_file   : (data1) 18
│ │ +    <733>   DW_AT_name        : (strp) (offset: 0x2304): co_flags
│ │ +    <737>   DW_AT_decl_file   : (data1) 19
│ │      <738>   DW_AT_decl_line   : (data1) 103
│ │      <739>   DW_AT_decl_column : (data1) 21
│ │      <73a>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <73e>   DW_AT_data_member_location: (data1) 48
│ │   <2><73f>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <740>   DW_AT_name        : (strp) (offset: 0x1af8): co_warmup
│ │ -    <744>   DW_AT_decl_file   : (data1) 18
│ │ +    <740>   DW_AT_name        : (strp) (offset: 0x1b29): co_warmup
│ │ +    <744>   DW_AT_decl_file   : (data1) 19
│ │      <745>   DW_AT_decl_line   : (data1) 103
│ │      <746>   DW_AT_decl_column : (data1) 21
│ │      <747>   DW_AT_type        : (ref4) <0x168>, short int
│ │      <74b>   DW_AT_data_member_location: (data1) 52
│ │   <2><74c>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <74d>   DW_AT_name        : (strp) (offset: 0xca2): _co_linearray_entry_size
│ │ -    <751>   DW_AT_decl_file   : (data1) 18
│ │ +    <74d>   DW_AT_name        : (strp) (offset: 0xcb2): _co_linearray_entry_size
│ │ +    <751>   DW_AT_decl_file   : (data1) 19
│ │      <752>   DW_AT_decl_line   : (data1) 103
│ │      <753>   DW_AT_decl_column : (data1) 21
│ │      <754>   DW_AT_type        : (ref4) <0x168>, short int
│ │      <758>   DW_AT_data_member_location: (data1) 54
│ │   <2><759>: Abbrev Number: 15 (DW_TAG_member)
│ │      <75a>   DW_AT_name        : (strp) (offset: 0x46d): co_argcount
│ │ -    <75e>   DW_AT_decl_file   : (data1) 18
│ │ +    <75e>   DW_AT_decl_file   : (data1) 19
│ │      <75f>   DW_AT_decl_line   : (data1) 103
│ │      <760>   DW_AT_decl_column : (data1) 21
│ │      <761>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <765>   DW_AT_data_member_location: (data1) 56
│ │   <2><766>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <767>   DW_AT_name        : (strp) (offset: 0xfd1): co_posonlyargcount
│ │ -    <76b>   DW_AT_decl_file   : (data1) 18
│ │ +    <767>   DW_AT_name        : (strp) (offset: 0xff6): co_posonlyargcount
│ │ +    <76b>   DW_AT_decl_file   : (data1) 19
│ │      <76c>   DW_AT_decl_line   : (data1) 103
│ │      <76d>   DW_AT_decl_column : (data1) 21
│ │      <76e>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <772>   DW_AT_data_member_location: (data1) 60
│ │   <2><773>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <774>   DW_AT_name        : (strp) (offset: 0x11d6): co_kwonlyargcount
│ │ -    <778>   DW_AT_decl_file   : (data1) 18
│ │ +    <774>   DW_AT_name        : (strp) (offset: 0x11fb): co_kwonlyargcount
│ │ +    <778>   DW_AT_decl_file   : (data1) 19
│ │      <779>   DW_AT_decl_line   : (data1) 103
│ │      <77a>   DW_AT_decl_column : (data1) 21
│ │      <77b>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <77f>   DW_AT_data_member_location: (data1) 64
│ │   <2><780>: Abbrev Number: 15 (DW_TAG_member)
│ │      <781>   DW_AT_name        : (strp) (offset: 0x548): co_stacksize
│ │ -    <785>   DW_AT_decl_file   : (data1) 18
│ │ +    <785>   DW_AT_decl_file   : (data1) 19
│ │      <786>   DW_AT_decl_line   : (data1) 103
│ │      <787>   DW_AT_decl_column : (data1) 21
│ │      <788>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <78c>   DW_AT_data_member_location: (data1) 68
│ │   <2><78d>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <78e>   DW_AT_name        : (strp) (offset: 0xbc0): co_firstlineno
│ │ -    <792>   DW_AT_decl_file   : (data1) 18
│ │ +    <78e>   DW_AT_name        : (strp) (offset: 0xbc5): co_firstlineno
│ │ +    <792>   DW_AT_decl_file   : (data1) 19
│ │      <793>   DW_AT_decl_line   : (data1) 103
│ │      <794>   DW_AT_decl_column : (data1) 21
│ │      <795>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <799>   DW_AT_data_member_location: (data1) 72
│ │   <2><79a>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <79b>   DW_AT_name        : (strp) (offset: 0x22cc): co_nlocalsplus
│ │ -    <79f>   DW_AT_decl_file   : (data1) 18
│ │ +    <79b>   DW_AT_name        : (strp) (offset: 0x230d): co_nlocalsplus
│ │ +    <79f>   DW_AT_decl_file   : (data1) 19
│ │      <7a0>   DW_AT_decl_line   : (data1) 103
│ │      <7a1>   DW_AT_decl_column : (data1) 21
│ │      <7a2>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <7a6>   DW_AT_data_member_location: (data1) 76
│ │   <2><7a7>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <7a8>   DW_AT_name        : (strp) (offset: 0x99a): co_nlocals
│ │ -    <7ac>   DW_AT_decl_file   : (data1) 18
│ │ +    <7a8>   DW_AT_name        : (strp) (offset: 0x9a7): co_nlocals
│ │ +    <7ac>   DW_AT_decl_file   : (data1) 19
│ │      <7ad>   DW_AT_decl_line   : (data1) 103
│ │      <7ae>   DW_AT_decl_column : (data1) 21
│ │      <7af>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <7b3>   DW_AT_data_member_location: (data1) 80
│ │   <2><7b4>: Abbrev Number: 15 (DW_TAG_member)
│ │      <7b5>   DW_AT_name        : (strp) (offset: 0x968): co_nplaincellvars
│ │ -    <7b9>   DW_AT_decl_file   : (data1) 18
│ │ +    <7b9>   DW_AT_decl_file   : (data1) 19
│ │      <7ba>   DW_AT_decl_line   : (data1) 103
│ │      <7bb>   DW_AT_decl_column : (data1) 21
│ │      <7bc>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <7c0>   DW_AT_data_member_location: (data1) 84
│ │   <2><7c1>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <7c2>   DW_AT_name        : (strp) (offset: 0x1c43): co_ncellvars
│ │ -    <7c6>   DW_AT_decl_file   : (data1) 18
│ │ +    <7c2>   DW_AT_name        : (strp) (offset: 0x1c74): co_ncellvars
│ │ +    <7c6>   DW_AT_decl_file   : (data1) 19
│ │      <7c7>   DW_AT_decl_line   : (data1) 103
│ │      <7c8>   DW_AT_decl_column : (data1) 21
│ │      <7c9>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <7cd>   DW_AT_data_member_location: (data1) 88
│ │   <2><7ce>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <7cf>   DW_AT_name        : (strp) (offset: 0x1c71): co_nfreevars
│ │ -    <7d3>   DW_AT_decl_file   : (data1) 18
│ │ +    <7cf>   DW_AT_name        : (strp) (offset: 0x1ca2): co_nfreevars
│ │ +    <7d3>   DW_AT_decl_file   : (data1) 19
│ │      <7d4>   DW_AT_decl_line   : (data1) 103
│ │      <7d5>   DW_AT_decl_column : (data1) 21
│ │      <7d6>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <7da>   DW_AT_data_member_location: (data1) 92
│ │   <2><7db>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <7dc>   DW_AT_name        : (strp) (offset: 0x1563): co_localsplusnames
│ │ -    <7e0>   DW_AT_decl_file   : (data1) 18
│ │ +    <7dc>   DW_AT_name        : (strp) (offset: 0x1588): co_localsplusnames
│ │ +    <7e0>   DW_AT_decl_file   : (data1) 19
│ │      <7e1>   DW_AT_decl_line   : (data1) 103
│ │      <7e2>   DW_AT_decl_column : (data1) 21
│ │      <7e3>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <7e7>   DW_AT_data_member_location: (data1) 96
│ │   <2><7e8>: Abbrev Number: 15 (DW_TAG_member)
│ │      <7e9>   DW_AT_name        : (strp) (offset: 0x8a5): co_localspluskinds
│ │ -    <7ed>   DW_AT_decl_file   : (data1) 18
│ │ +    <7ed>   DW_AT_decl_file   : (data1) 19
│ │      <7ee>   DW_AT_decl_line   : (data1) 103
│ │      <7ef>   DW_AT_decl_column : (data1) 21
│ │      <7f0>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <7f4>   DW_AT_data_member_location: (data1) 104
│ │   <2><7f5>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <7f6>   DW_AT_name        : (strp) (offset: 0x159c): co_filename
│ │ -    <7fa>   DW_AT_decl_file   : (data1) 18
│ │ +    <7f6>   DW_AT_name        : (strp) (offset: 0x15c1): co_filename
│ │ +    <7fa>   DW_AT_decl_file   : (data1) 19
│ │      <7fb>   DW_AT_decl_line   : (data1) 103
│ │      <7fc>   DW_AT_decl_column : (data1) 21
│ │      <7fd>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <801>   DW_AT_data_member_location: (data1) 112
│ │   <2><802>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <803>   DW_AT_name        : (strp) (offset: 0xb88): co_name
│ │ -    <807>   DW_AT_decl_file   : (data1) 18
│ │ +    <803>   DW_AT_name        : (strp) (offset: 0xb8d): co_name
│ │ +    <807>   DW_AT_decl_file   : (data1) 19
│ │      <808>   DW_AT_decl_line   : (data1) 103
│ │      <809>   DW_AT_decl_column : (data1) 21
│ │      <80a>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <80e>   DW_AT_data_member_location: (data1) 120
│ │   <2><80f>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <810>   DW_AT_name        : (strp) (offset: 0x247f): co_qualname
│ │ -    <814>   DW_AT_decl_file   : (data1) 18
│ │ +    <810>   DW_AT_name        : (strp) (offset: 0x24c0): co_qualname
│ │ +    <814>   DW_AT_decl_file   : (data1) 19
│ │      <815>   DW_AT_decl_line   : (data1) 103
│ │      <816>   DW_AT_decl_column : (data1) 21
│ │      <817>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <81b>   DW_AT_data_member_location: (data1) 128
│ │   <2><81c>: Abbrev Number: 15 (DW_TAG_member)
│ │      <81d>   DW_AT_name        : (strp) (offset: 0x429): co_linetable
│ │ -    <821>   DW_AT_decl_file   : (data1) 18
│ │ +    <821>   DW_AT_decl_file   : (data1) 19
│ │      <822>   DW_AT_decl_line   : (data1) 103
│ │      <823>   DW_AT_decl_column : (data1) 21
│ │      <824>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <828>   DW_AT_data_member_location: (data1) 136
│ │   <2><829>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <82a>   DW_AT_name        : (strp) (offset: 0x1f5f): co_weakreflist
│ │ -    <82e>   DW_AT_decl_file   : (data1) 18
│ │ +    <82a>   DW_AT_name        : (strp) (offset: 0x1f90): co_weakreflist
│ │ +    <82e>   DW_AT_decl_file   : (data1) 19
│ │      <82f>   DW_AT_decl_line   : (data1) 103
│ │      <830>   DW_AT_decl_column : (data1) 21
│ │      <831>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <835>   DW_AT_data_member_location: (data1) 144
│ │   <2><836>: Abbrev Number: 15 (DW_TAG_member)
│ │      <837>   DW_AT_name        : (strp) (offset: 0x70b): _co_code
│ │ -    <83b>   DW_AT_decl_file   : (data1) 18
│ │ +    <83b>   DW_AT_decl_file   : (data1) 19
│ │      <83c>   DW_AT_decl_line   : (data1) 103
│ │      <83d>   DW_AT_decl_column : (data1) 21
│ │      <83e>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <842>   DW_AT_data_member_location: (data1) 152
│ │   <2><843>: Abbrev Number: 15 (DW_TAG_member)
│ │      <844>   DW_AT_name        : (strp) (offset: 0x1f7): _co_linearray
│ │ -    <848>   DW_AT_decl_file   : (data1) 18
│ │ +    <848>   DW_AT_decl_file   : (data1) 19
│ │      <849>   DW_AT_decl_line   : (data1) 103
│ │      <84a>   DW_AT_decl_column : (data1) 21
│ │      <84b>   DW_AT_type        : (ref4) <0xea>, char
│ │      <84f>   DW_AT_data_member_location: (data1) 160
│ │   <2><850>: Abbrev Number: 15 (DW_TAG_member)
│ │      <851>   DW_AT_name        : (strp) (offset: 0x6ba): _co_firsttraceable
│ │ -    <855>   DW_AT_decl_file   : (data1) 18
│ │ +    <855>   DW_AT_decl_file   : (data1) 19
│ │      <856>   DW_AT_decl_line   : (data1) 103
│ │      <857>   DW_AT_decl_column : (data1) 21
│ │      <858>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <85c>   DW_AT_data_member_location: (data1) 168
│ │   <2><85d>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <85e>   DW_AT_name        : (strp) (offset: 0xc18): co_extra
│ │ -    <862>   DW_AT_decl_file   : (data1) 18
│ │ +    <85e>   DW_AT_name        : (strp) (offset: 0xc1d): co_extra
│ │ +    <862>   DW_AT_decl_file   : (data1) 19
│ │      <863>   DW_AT_decl_line   : (data1) 103
│ │      <864>   DW_AT_decl_column : (data1) 21
│ │      <865>   DW_AT_type        : (ref4) <0x88>
│ │      <869>   DW_AT_data_member_location: (data1) 176
│ │   <2><86a>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <86b>   DW_AT_name        : (strp) (offset: 0x2277): co_code_adaptive
│ │ -    <86f>   DW_AT_decl_file   : (data1) 18
│ │ +    <86b>   DW_AT_name        : (strp) (offset: 0x22b8): co_code_adaptive
│ │ +    <86f>   DW_AT_decl_file   : (data1) 19
│ │      <870>   DW_AT_decl_line   : (data1) 103
│ │      <871>   DW_AT_decl_column : (data1) 21
│ │      <872>   DW_AT_type        : (ref4) <0x1639>, char
│ │      <876>   DW_AT_data_member_location: (data1) 184
│ │   <2><877>: Abbrev Number: 0
│ │   <1><878>: Abbrev Number: 3 (DW_TAG_typedef)
│ │      <879>   DW_AT_name        : (strp) (offset: 0x156): PyFrameObject
│ │ -    <87d>   DW_AT_decl_file   : (data1) 12
│ │ +    <87d>   DW_AT_decl_file   : (data1) 13
│ │      <87e>   DW_AT_decl_line   : (data1) 22
│ │      <87f>   DW_AT_decl_column : (data1) 23
│ │      <880>   DW_AT_type        : (ref4) <0x884>, _frame
│ │   <1><884>: Abbrev Number: 8 (DW_TAG_structure_type)
│ │      <885>   DW_AT_name        : (strp) (offset: 0x56d): _frame
│ │      <889>   DW_AT_declaration : (flag_present) 1
│ │   <1><889>: Abbrev Number: 3 (DW_TAG_typedef)
│ │ -    <88a>   DW_AT_name        : (strp) (offset: 0xa7b): PyThreadState
│ │ -    <88e>   DW_AT_decl_file   : (data1) 12
│ │ +    <88a>   DW_AT_name        : (strp) (offset: 0xa80): PyThreadState
│ │ +    <88e>   DW_AT_decl_file   : (data1) 13
│ │      <88f>   DW_AT_decl_line   : (data1) 24
│ │      <890>   DW_AT_decl_column : (data1) 20
│ │      <891>   DW_AT_type        : (ref4) <0x895>, _ts
│ │   <1><895>: Abbrev Number: 19 (DW_TAG_structure_type)
│ │      <896>   DW_AT_name        : (string) _ts
│ │      <89a>   DW_AT_byte_size   : (data2) 360
│ │ -    <89c>   DW_AT_decl_file   : (data1) 19
│ │ +    <89c>   DW_AT_decl_file   : (data1) 20
│ │      <89d>   DW_AT_decl_line   : (data1) 82
│ │      <89e>   DW_AT_decl_column : (data1) 8
│ │      <89f>   DW_AT_sibling     : (ref4) <0xab0>
│ │   <2><8a3>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <8a4>   DW_AT_name        : (strp) (offset: 0x2423): prev
│ │ -    <8a8>   DW_AT_decl_file   : (data1) 19
│ │ +    <8a4>   DW_AT_name        : (strp) (offset: 0x2464): prev
│ │ +    <8a8>   DW_AT_decl_file   : (data1) 20
│ │      <8a9>   DW_AT_decl_line   : (data1) 85
│ │      <8aa>   DW_AT_decl_column : (data1) 20
│ │      <8ab>   DW_AT_type        : (ref4) <0x1d29>, PyThreadState, _ts
│ │      <8af>   DW_AT_data_member_location: (data1) 0
│ │   <2><8b0>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <8b1>   DW_AT_name        : (strp) (offset: 0x2368): next
│ │ -    <8b5>   DW_AT_decl_file   : (data1) 19
│ │ +    <8b1>   DW_AT_name        : (strp) (offset: 0x23a9): next
│ │ +    <8b5>   DW_AT_decl_file   : (data1) 20
│ │      <8b6>   DW_AT_decl_line   : (data1) 86
│ │      <8b7>   DW_AT_decl_column : (data1) 20
│ │      <8b8>   DW_AT_type        : (ref4) <0x1d29>, PyThreadState, _ts
│ │      <8bc>   DW_AT_data_member_location: (data1) 8
│ │   <2><8bd>: Abbrev Number: 15 (DW_TAG_member)
│ │      <8be>   DW_AT_name        : (strp) (offset: 0x592): interp
│ │ -    <8c2>   DW_AT_decl_file   : (data1) 19
│ │ +    <8c2>   DW_AT_decl_file   : (data1) 20
│ │      <8c3>   DW_AT_decl_line   : (data1) 87
│ │      <8c4>   DW_AT_decl_column : (data1) 25
│ │      <8c5>   DW_AT_type        : (ref4) <0x1d2f>, PyInterpreterState, _is
│ │      <8c9>   DW_AT_data_member_location: (data1) 16
│ │   <2><8ca>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <8cb>   DW_AT_name        : (strp) (offset: 0x1896): _initialized
│ │ -    <8cf>   DW_AT_decl_file   : (data1) 19
│ │ +    <8cb>   DW_AT_name        : (strp) (offset: 0x18bb): _initialized
│ │ +    <8cf>   DW_AT_decl_file   : (data1) 20
│ │      <8d0>   DW_AT_decl_line   : (data1) 93
│ │      <8d1>   DW_AT_decl_column : (data1) 9
│ │      <8d2>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <8d6>   DW_AT_data_member_location: (data1) 24
│ │   <2><8d7>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <8d8>   DW_AT_name        : (strp) (offset: 0x1d19): _static
│ │ -    <8dc>   DW_AT_decl_file   : (data1) 19
│ │ +    <8d8>   DW_AT_name        : (strp) (offset: 0x1d4a): _static
│ │ +    <8dc>   DW_AT_decl_file   : (data1) 20
│ │      <8dd>   DW_AT_decl_line   : (data1) 96
│ │      <8de>   DW_AT_decl_column : (data1) 9
│ │      <8df>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <8e3>   DW_AT_data_member_location: (data1) 28
│ │   <2><8e4>: Abbrev Number: 15 (DW_TAG_member)
│ │      <8e5>   DW_AT_name        : (strp) (offset: 0x62f): recursion_remaining
│ │ -    <8e9>   DW_AT_decl_file   : (data1) 19
│ │ +    <8e9>   DW_AT_decl_file   : (data1) 20
│ │      <8ea>   DW_AT_decl_line   : (data1) 98
│ │      <8eb>   DW_AT_decl_column : (data1) 9
│ │      <8ec>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <8f0>   DW_AT_data_member_location: (data1) 32
│ │   <2><8f1>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <8f2>   DW_AT_name        : (strp) (offset: 0x2131): recursion_limit
│ │ -    <8f6>   DW_AT_decl_file   : (data1) 19
│ │ +    <8f2>   DW_AT_name        : (strp) (offset: 0x2162): recursion_limit
│ │ +    <8f6>   DW_AT_decl_file   : (data1) 20
│ │      <8f7>   DW_AT_decl_line   : (data1) 99
│ │      <8f8>   DW_AT_decl_column : (data1) 9
│ │      <8f9>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <8fd>   DW_AT_data_member_location: (data1) 36
│ │   <2><8fe>: Abbrev Number: 15 (DW_TAG_member)
│ │      <8ff>   DW_AT_name        : (strp) (offset: 0x22c): recursion_headroom
│ │ -    <903>   DW_AT_decl_file   : (data1) 19
│ │ +    <903>   DW_AT_decl_file   : (data1) 20
│ │      <904>   DW_AT_decl_line   : (data1) 100
│ │      <905>   DW_AT_decl_column : (data1) 9
│ │      <906>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <90a>   DW_AT_data_member_location: (data1) 40
│ │   <2><90b>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <90c>   DW_AT_name        : (strp) (offset: 0x15c5): tracing
│ │ -    <910>   DW_AT_decl_file   : (data1) 19
│ │ +    <90c>   DW_AT_name        : (strp) (offset: 0x15ea): tracing
│ │ +    <910>   DW_AT_decl_file   : (data1) 20
│ │      <911>   DW_AT_decl_line   : (data1) 105
│ │      <912>   DW_AT_decl_column : (data1) 9
│ │      <913>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <917>   DW_AT_data_member_location: (data1) 44
│ │   <2><918>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <919>   DW_AT_name        : (strp) (offset: 0x1f6e): tracing_what
│ │ -    <91d>   DW_AT_decl_file   : (data1) 19
│ │ +    <919>   DW_AT_name        : (strp) (offset: 0x1f9f): tracing_what
│ │ +    <91d>   DW_AT_decl_file   : (data1) 20
│ │      <91e>   DW_AT_decl_line   : (data1) 106
│ │      <91f>   DW_AT_decl_column : (data1) 9
│ │      <920>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <924>   DW_AT_data_member_location: (data1) 48
│ │   <2><925>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <926>   DW_AT_name        : (strp) (offset: 0x138d): cframe
│ │ -    <92a>   DW_AT_decl_file   : (data1) 19
│ │ +    <926>   DW_AT_name        : (strp) (offset: 0x13b2): cframe
│ │ +    <92a>   DW_AT_decl_file   : (data1) 20
│ │      <92b>   DW_AT_decl_line   : (data1) 110
│ │      <92c>   DW_AT_decl_column : (data1) 16
│ │      <92d>   DW_AT_type        : (ref4) <0x1d35>, _PyCFrame, _PyCFrame
│ │      <931>   DW_AT_data_member_location: (data1) 56
│ │   <2><932>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <933>   DW_AT_name        : (strp) (offset: 0xc66): c_profilefunc
│ │ -    <937>   DW_AT_decl_file   : (data1) 19
│ │ +    <933>   DW_AT_name        : (strp) (offset: 0xc6b): c_profilefunc
│ │ +    <937>   DW_AT_decl_file   : (data1) 20
│ │      <938>   DW_AT_decl_line   : (data1) 112
│ │      <939>   DW_AT_decl_column : (data1) 18
│ │      <93a>   DW_AT_type        : (ref4) <0x1be3>, Py_tracefunc, int
│ │      <93e>   DW_AT_data_member_location: (data1) 64
│ │   <2><93f>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <940>   DW_AT_name        : (strp) (offset: 0x12df): c_tracefunc
│ │ -    <944>   DW_AT_decl_file   : (data1) 19
│ │ +    <940>   DW_AT_name        : (strp) (offset: 0x1304): c_tracefunc
│ │ +    <944>   DW_AT_decl_file   : (data1) 20
│ │      <945>   DW_AT_decl_line   : (data1) 113
│ │      <946>   DW_AT_decl_column : (data1) 18
│ │      <947>   DW_AT_type        : (ref4) <0x1be3>, Py_tracefunc, int
│ │      <94b>   DW_AT_data_member_location: (data1) 72
│ │   <2><94c>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <94d>   DW_AT_name        : (strp) (offset: 0x13bc): c_profileobj
│ │ -    <951>   DW_AT_decl_file   : (data1) 19
│ │ +    <94d>   DW_AT_name        : (strp) (offset: 0x13e1): c_profileobj
│ │ +    <951>   DW_AT_decl_file   : (data1) 20
│ │      <952>   DW_AT_decl_line   : (data1) 114
│ │      <953>   DW_AT_decl_column : (data1) 15
│ │      <954>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <958>   DW_AT_data_member_location: (data1) 80
│ │   <2><959>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <95a>   DW_AT_name        : (strp) (offset: 0x1509): c_traceobj
│ │ -    <95e>   DW_AT_decl_file   : (data1) 19
│ │ +    <95a>   DW_AT_name        : (strp) (offset: 0x152e): c_traceobj
│ │ +    <95e>   DW_AT_decl_file   : (data1) 20
│ │      <95f>   DW_AT_decl_line   : (data1) 115
│ │      <960>   DW_AT_decl_column : (data1) 15
│ │      <961>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <965>   DW_AT_data_member_location: (data1) 88
│ │   <2><966>: Abbrev Number: 15 (DW_TAG_member)
│ │      <967>   DW_AT_name        : (strp) (offset: 0x6dc): curexc_type
│ │ -    <96b>   DW_AT_decl_file   : (data1) 19
│ │ +    <96b>   DW_AT_decl_file   : (data1) 20
│ │      <96c>   DW_AT_decl_line   : (data1) 118
│ │      <96d>   DW_AT_decl_column : (data1) 15
│ │      <96e>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <972>   DW_AT_data_member_location: (data1) 96
│ │   <2><973>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <974>   DW_AT_name        : (strp) (offset: 0xafd): curexc_value
│ │ -    <978>   DW_AT_decl_file   : (data1) 19
│ │ +    <974>   DW_AT_name        : (strp) (offset: 0xb02): curexc_value
│ │ +    <978>   DW_AT_decl_file   : (data1) 20
│ │      <979>   DW_AT_decl_line   : (data1) 119
│ │      <97a>   DW_AT_decl_column : (data1) 15
│ │      <97b>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <97f>   DW_AT_data_member_location: (data1) 104
│ │   <2><980>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <981>   DW_AT_name        : (strp) (offset: 0xa14): curexc_traceback
│ │ -    <985>   DW_AT_decl_file   : (data1) 19
│ │ +    <981>   DW_AT_name        : (strp) (offset: 0xa21): curexc_traceback
│ │ +    <985>   DW_AT_decl_file   : (data1) 20
│ │      <986>   DW_AT_decl_line   : (data1) 120
│ │      <987>   DW_AT_decl_column : (data1) 15
│ │      <988>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <98c>   DW_AT_data_member_location: (data1) 112
│ │   <2><98d>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <98e>   DW_AT_name        : (strp) (offset: 0x10c4): exc_info
│ │ -    <992>   DW_AT_decl_file   : (data1) 19
│ │ +    <98e>   DW_AT_name        : (strp) (offset: 0x10e9): exc_info
│ │ +    <992>   DW_AT_decl_file   : (data1) 20
│ │      <993>   DW_AT_decl_line   : (data1) 125
│ │      <994>   DW_AT_decl_column : (data1) 23
│ │      <995>   DW_AT_type        : (ref4) <0x1d3b>, _PyErr_StackItem, _err_stackitem
│ │      <999>   DW_AT_data_member_location: (data1) 120
│ │   <2><99a>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <99b>   DW_AT_name        : (strp) (offset: 0xcd0): dict
│ │ -    <99f>   DW_AT_decl_file   : (data1) 19
│ │ +    <99b>   DW_AT_name        : (strp) (offset: 0xce0): dict
│ │ +    <99f>   DW_AT_decl_file   : (data1) 20
│ │      <9a0>   DW_AT_decl_line   : (data1) 127
│ │      <9a1>   DW_AT_decl_column : (data1) 15
│ │      <9a2>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <9a6>   DW_AT_data_member_location: (data1) 128
│ │   <2><9a7>: Abbrev Number: 15 (DW_TAG_member)
│ │      <9a8>   DW_AT_name        : (strp) (offset: 0x67d): gilstate_counter
│ │ -    <9ac>   DW_AT_decl_file   : (data1) 19
│ │ +    <9ac>   DW_AT_decl_file   : (data1) 20
│ │      <9ad>   DW_AT_decl_line   : (data1) 129
│ │      <9ae>   DW_AT_decl_column : (data1) 9
│ │      <9af>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <9b3>   DW_AT_data_member_location: (data1) 136
│ │   <2><9b4>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <9b5>   DW_AT_name        : (strp) (offset: 0x1f08): async_exc
│ │ -    <9b9>   DW_AT_decl_file   : (data1) 19
│ │ +    <9b5>   DW_AT_name        : (strp) (offset: 0x1f39): async_exc
│ │ +    <9b9>   DW_AT_decl_file   : (data1) 20
│ │      <9ba>   DW_AT_decl_line   : (data1) 131
│ │      <9bb>   DW_AT_decl_column : (data1) 15
│ │      <9bc>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <9c0>   DW_AT_data_member_location: (data1) 144
│ │   <2><9c1>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <9c2>   DW_AT_name        : (strp) (offset: 0x114a): thread_id
│ │ -    <9c6>   DW_AT_decl_file   : (data1) 19
│ │ +    <9c2>   DW_AT_name        : (strp) (offset: 0x116f): thread_id
│ │ +    <9c6>   DW_AT_decl_file   : (data1) 20
│ │      <9c7>   DW_AT_decl_line   : (data1) 132
│ │      <9c8>   DW_AT_decl_column : (data1) 19
│ │      <9c9>   DW_AT_type        : (ref4) <0x62>, long unsigned int
│ │      <9cd>   DW_AT_data_member_location: (data1) 152
│ │   <2><9ce>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <9cf>   DW_AT_name        : (strp) (offset: 0x1143): native_thread_id
│ │ -    <9d3>   DW_AT_decl_file   : (data1) 19
│ │ +    <9cf>   DW_AT_name        : (strp) (offset: 0x1168): native_thread_id
│ │ +    <9d3>   DW_AT_decl_file   : (data1) 20
│ │      <9d4>   DW_AT_decl_line   : (data1) 138
│ │      <9d5>   DW_AT_decl_column : (data1) 19
│ │      <9d6>   DW_AT_type        : (ref4) <0x62>, long unsigned int
│ │      <9da>   DW_AT_data_member_location: (data1) 160
│ │   <2><9db>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <9dc>   DW_AT_name        : (strp) (offset: 0x216b): trash_delete_nesting
│ │ -    <9e0>   DW_AT_decl_file   : (data1) 19
│ │ +    <9dc>   DW_AT_name        : (strp) (offset: 0x219c): trash_delete_nesting
│ │ +    <9e0>   DW_AT_decl_file   : (data1) 20
│ │      <9e1>   DW_AT_decl_line   : (data1) 140
│ │      <9e2>   DW_AT_decl_column : (data1) 9
│ │      <9e3>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <9e7>   DW_AT_data_member_location: (data1) 168
│ │   <2><9e8>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <9e9>   DW_AT_name        : (strp) (offset: 0x1c21): trash_delete_later
│ │ -    <9ed>   DW_AT_decl_file   : (data1) 19
│ │ +    <9e9>   DW_AT_name        : (strp) (offset: 0x1c52): trash_delete_later
│ │ +    <9ed>   DW_AT_decl_file   : (data1) 20
│ │      <9ee>   DW_AT_decl_line   : (data1) 141
│ │      <9ef>   DW_AT_decl_column : (data1) 15
│ │      <9f0>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <9f4>   DW_AT_data_member_location: (data1) 176
│ │   <2><9f5>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <9f6>   DW_AT_name        : (strp) (offset: 0x1db2): on_delete
│ │ -    <9fa>   DW_AT_decl_file   : (data1) 19
│ │ +    <9f6>   DW_AT_name        : (strp) (offset: 0x1de3): on_delete
│ │ +    <9fa>   DW_AT_decl_file   : (data1) 20
│ │      <9fb>   DW_AT_decl_line   : (data1) 166
│ │      <9fc>   DW_AT_decl_column : (data1) 12
│ │      <9fd>   DW_AT_type        : (ref4) <0xd60>
│ │      <a01>   DW_AT_data_member_location: (data1) 184
│ │   <2><a02>: Abbrev Number: 15 (DW_TAG_member)
│ │      <a03>   DW_AT_name        : (strp) (offset: 0xd8): on_delete_data
│ │ -    <a07>   DW_AT_decl_file   : (data1) 19
│ │ +    <a07>   DW_AT_decl_file   : (data1) 20
│ │      <a08>   DW_AT_decl_line   : (data1) 167
│ │      <a09>   DW_AT_decl_column : (data1) 11
│ │      <a0a>   DW_AT_type        : (ref4) <0x88>
│ │      <a0e>   DW_AT_data_member_location: (data1) 192
│ │   <2><a0f>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <a10>   DW_AT_name        : (strp) (offset: 0x20d0): coroutine_origin_tracking_depth
│ │ -    <a14>   DW_AT_decl_file   : (data1) 19
│ │ +    <a10>   DW_AT_name        : (strp) (offset: 0x2101): coroutine_origin_tracking_depth
│ │ +    <a14>   DW_AT_decl_file   : (data1) 20
│ │      <a15>   DW_AT_decl_line   : (data1) 169
│ │      <a16>   DW_AT_decl_column : (data1) 9
│ │      <a17>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <a1b>   DW_AT_data_member_location: (data1) 200
│ │   <2><a1c>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <a1d>   DW_AT_name        : (strp) (offset: 0x1eb9): async_gen_firstiter
│ │ -    <a21>   DW_AT_decl_file   : (data1) 19
│ │ +    <a1d>   DW_AT_name        : (strp) (offset: 0x1eea): async_gen_firstiter
│ │ +    <a21>   DW_AT_decl_file   : (data1) 20
│ │      <a22>   DW_AT_decl_line   : (data1) 171
│ │      <a23>   DW_AT_decl_column : (data1) 15
│ │      <a24>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <a28>   DW_AT_data_member_location: (data1) 208
│ │   <2><a29>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <a2a>   DW_AT_name        : (strp) (offset: 0xdfa): async_gen_finalizer
│ │ -    <a2e>   DW_AT_decl_file   : (data1) 19
│ │ +    <a2a>   DW_AT_name        : (strp) (offset: 0xe13): async_gen_finalizer
│ │ +    <a2e>   DW_AT_decl_file   : (data1) 20
│ │      <a2f>   DW_AT_decl_line   : (data1) 172
│ │      <a30>   DW_AT_decl_column : (data1) 15
│ │      <a31>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <a35>   DW_AT_data_member_location: (data1) 216
│ │   <2><a36>: Abbrev Number: 15 (DW_TAG_member)
│ │      <a37>   DW_AT_name        : (strp) (offset: 0x764): context
│ │ -    <a3b>   DW_AT_decl_file   : (data1) 19
│ │ +    <a3b>   DW_AT_decl_file   : (data1) 20
│ │      <a3c>   DW_AT_decl_line   : (data1) 174
│ │      <a3d>   DW_AT_decl_column : (data1) 15
│ │      <a3e>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <a42>   DW_AT_data_member_location: (data1) 224
│ │   <2><a43>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <a44>   DW_AT_name        : (strp) (offset: 0x1932): context_ver
│ │ -    <a48>   DW_AT_decl_file   : (data1) 19
│ │ +    <a44>   DW_AT_name        : (strp) (offset: 0x1957): context_ver
│ │ +    <a48>   DW_AT_decl_file   : (data1) 20
│ │      <a49>   DW_AT_decl_line   : (data1) 175
│ │      <a4a>   DW_AT_decl_column : (data1) 14
│ │      <a4b>   DW_AT_type        : (ref4) <0x19f>, uint64_t, long unsigned int
│ │      <a4f>   DW_AT_data_member_location: (data1) 232
│ │   <2><a50>: Abbrev Number: 16 (DW_TAG_member)
│ │      <a51>   DW_AT_name        : (string) id
│ │ -    <a54>   DW_AT_decl_file   : (data1) 19
│ │ +    <a54>   DW_AT_decl_file   : (data1) 20
│ │      <a55>   DW_AT_decl_line   : (data1) 178
│ │      <a56>   DW_AT_decl_column : (data1) 14
│ │      <a57>   DW_AT_type        : (ref4) <0x19f>, uint64_t, long unsigned int
│ │      <a5b>   DW_AT_data_member_location: (data1) 240
│ │   <2><a5c>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <a5d>   DW_AT_name        : (strp) (offset: 0x21f4): trace_info
│ │ -    <a61>   DW_AT_decl_file   : (data1) 19
│ │ +    <a5d>   DW_AT_name        : (strp) (offset: 0x2225): trace_info
│ │ +    <a61>   DW_AT_decl_file   : (data1) 20
│ │      <a62>   DW_AT_decl_line   : (data1) 180
│ │      <a63>   DW_AT_decl_column : (data1) 17
│ │      <a64>   DW_AT_type        : (ref4) <0x1c3d>, PyTraceInfo
│ │      <a68>   DW_AT_data_member_location: (data1) 248
│ │   <2><a69>: Abbrev Number: 18 (DW_TAG_member)
│ │ -    <a6a>   DW_AT_name        : (strp) (offset: 0x12eb): datastack_chunk
│ │ -    <a6e>   DW_AT_decl_file   : (data1) 19
│ │ +    <a6a>   DW_AT_name        : (strp) (offset: 0x1310): datastack_chunk
│ │ +    <a6e>   DW_AT_decl_file   : (data1) 20
│ │      <a6f>   DW_AT_decl_line   : (data1) 182
│ │      <a70>   DW_AT_decl_column : (data1) 20
│ │      <a71>   DW_AT_type        : (ref4) <0x1d41>, _PyStackChunk, _stack_chunk
│ │      <a75>   DW_AT_data_member_location: (data2) 296
│ │   <2><a77>: Abbrev Number: 18 (DW_TAG_member)
│ │      <a78>   DW_AT_name        : (strp) (offset: 0x5f3): datastack_top
│ │ -    <a7c>   DW_AT_decl_file   : (data1) 19
│ │ +    <a7c>   DW_AT_decl_file   : (data1) 20
│ │      <a7d>   DW_AT_decl_line   : (data1) 183
│ │      <a7e>   DW_AT_decl_column : (data1) 16
│ │      <a7f>   DW_AT_type        : (ref4) <0x1351>, PyObject, _object
│ │      <a83>   DW_AT_data_member_location: (data2) 304
│ │   <2><a85>: Abbrev Number: 18 (DW_TAG_member)
│ │ -    <a86>   DW_AT_name        : (strp) (offset: 0x1eed): datastack_limit
│ │ -    <a8a>   DW_AT_decl_file   : (data1) 19
│ │ +    <a86>   DW_AT_name        : (strp) (offset: 0x1f1e): datastack_limit
│ │ +    <a8a>   DW_AT_decl_file   : (data1) 20
│ │      <a8b>   DW_AT_decl_line   : (data1) 184
│ │      <a8c>   DW_AT_decl_column : (data1) 16
│ │      <a8d>   DW_AT_type        : (ref4) <0x1351>, PyObject, _object
│ │      <a91>   DW_AT_data_member_location: (data2) 312
│ │   <2><a93>: Abbrev Number: 18 (DW_TAG_member)
│ │      <a94>   DW_AT_name        : (strp) (offset: 0x588): exc_state
│ │ -    <a98>   DW_AT_decl_file   : (data1) 19
│ │ +    <a98>   DW_AT_decl_file   : (data1) 20
│ │      <a99>   DW_AT_decl_line   : (data1) 199
│ │      <a9a>   DW_AT_decl_column : (data1) 22
│ │      <a9b>   DW_AT_type        : (ref4) <0x1cc9>, _PyErr_StackItem, _err_stackitem
│ │      <a9f>   DW_AT_data_member_location: (data2) 320
│ │   <2><aa1>: Abbrev Number: 18 (DW_TAG_member)
│ │ -    <aa2>   DW_AT_name        : (strp) (offset: 0x1388): root_cframe
│ │ -    <aa6>   DW_AT_decl_file   : (data1) 19
│ │ +    <aa2>   DW_AT_name        : (strp) (offset: 0x13ad): root_cframe
│ │ +    <aa6>   DW_AT_decl_file   : (data1) 20
│ │      <aa7>   DW_AT_decl_line   : (data1) 202
│ │      <aa8>   DW_AT_decl_column : (data1) 15
│ │      <aa9>   DW_AT_type        : (ref4) <0x1c8f>, _PyCFrame, _PyCFrame
│ │      <aad>   DW_AT_data_member_location: (data2) 336
│ │   <2><aaf>: Abbrev Number: 0
│ │   <1><ab0>: Abbrev Number: 3 (DW_TAG_typedef)
│ │      <ab1>   DW_AT_name        : (strp) (offset: 0x68): PyInterpreterState
│ │ -    <ab5>   DW_AT_decl_file   : (data1) 12
│ │ +    <ab5>   DW_AT_decl_file   : (data1) 13
│ │      <ab6>   DW_AT_decl_line   : (data1) 25
│ │      <ab7>   DW_AT_decl_column : (data1) 20
│ │      <ab8>   DW_AT_type        : (ref4) <0xabc>, _is
│ │   <1><abc>: Abbrev Number: 20 (DW_TAG_structure_type)
│ │      <abd>   DW_AT_name        : (string) _is
│ │      <ac1>   DW_AT_declaration : (flag_present) 1
│ │   <1><ac1>: Abbrev Number: 21 (DW_TAG_structure_type)
│ │      <ac2>   DW_AT_byte_size   : (data1) 80
│ │ -    <ac3>   DW_AT_decl_file   : (data1) 20
│ │ +    <ac3>   DW_AT_decl_file   : (data1) 21
│ │      <ac4>   DW_AT_decl_line   : (data1) 20
│ │      <ac5>   DW_AT_decl_column : (data1) 9
│ │      <ac6>   DW_AT_sibling     : (ref4) <0xb5a>
│ │   <2><aca>: Abbrev Number: 16 (DW_TAG_member)
│ │      <acb>   DW_AT_name        : (string) buf
│ │ -    <acf>   DW_AT_decl_file   : (data1) 20
│ │ +    <acf>   DW_AT_decl_file   : (data1) 21
│ │      <ad0>   DW_AT_decl_line   : (data1) 21
│ │      <ad1>   DW_AT_decl_column : (data1) 11
│ │      <ad2>   DW_AT_type        : (ref4) <0x88>
│ │      <ad6>   DW_AT_data_member_location: (data1) 0
│ │   <2><ad7>: Abbrev Number: 16 (DW_TAG_member)
│ │      <ad8>   DW_AT_name        : (string) obj
│ │ -    <adc>   DW_AT_decl_file   : (data1) 20
│ │ +    <adc>   DW_AT_decl_file   : (data1) 21
│ │      <add>   DW_AT_decl_line   : (data1) 22
│ │      <ade>   DW_AT_decl_column : (data1) 15
│ │      <adf>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <ae3>   DW_AT_data_member_location: (data1) 8
│ │   <2><ae4>: Abbrev Number: 16 (DW_TAG_member)
│ │      <ae5>   DW_AT_name        : (string) len
│ │ -    <ae9>   DW_AT_decl_file   : (data1) 20
│ │ +    <ae9>   DW_AT_decl_file   : (data1) 21
│ │      <aea>   DW_AT_decl_line   : (data1) 23
│ │      <aeb>   DW_AT_decl_column : (data1) 16
│ │      <aec>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
│ │      <af0>   DW_AT_data_member_location: (data1) 16
│ │   <2><af1>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <af2>   DW_AT_name        : (strp) (offset: 0x1e1e): itemsize
│ │ -    <af6>   DW_AT_decl_file   : (data1) 20
│ │ +    <af2>   DW_AT_name        : (strp) (offset: 0x1e4f): itemsize
│ │ +    <af6>   DW_AT_decl_file   : (data1) 21
│ │      <af7>   DW_AT_decl_line   : (data1) 24
│ │      <af8>   DW_AT_decl_column : (data1) 16
│ │      <af9>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
│ │      <afd>   DW_AT_data_member_location: (data1) 24
│ │   <2><afe>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <aff>   DW_AT_name        : (strp) (offset: 0x1120): readonly
│ │ -    <b03>   DW_AT_decl_file   : (data1) 20
│ │ +    <aff>   DW_AT_name        : (strp) (offset: 0x1145): readonly
│ │ +    <b03>   DW_AT_decl_file   : (data1) 21
│ │      <b04>   DW_AT_decl_line   : (data1) 26
│ │      <b05>   DW_AT_decl_column : (data1) 9
│ │      <b06>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <b0a>   DW_AT_data_member_location: (data1) 32
│ │   <2><b0b>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <b0c>   DW_AT_name        : (strp) (offset: 0x995): ndim
│ │ -    <b10>   DW_AT_decl_file   : (data1) 20
│ │ +    <b0c>   DW_AT_name        : (strp) (offset: 0x9a2): ndim
│ │ +    <b10>   DW_AT_decl_file   : (data1) 21
│ │      <b11>   DW_AT_decl_line   : (data1) 27
│ │      <b12>   DW_AT_decl_column : (data1) 9
│ │      <b13>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <b17>   DW_AT_data_member_location: (data1) 36
│ │   <2><b18>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <b19>   DW_AT_name        : (strp) (offset: 0xf34): format
│ │ -    <b1d>   DW_AT_decl_file   : (data1) 20
│ │ +    <b19>   DW_AT_name        : (strp) (offset: 0xf59): format
│ │ +    <b1d>   DW_AT_decl_file   : (data1) 21
│ │      <b1e>   DW_AT_decl_line   : (data1) 28
│ │      <b1f>   DW_AT_decl_column : (data1) 11
│ │      <b20>   DW_AT_type        : (ref4) <0xea>, char
│ │      <b24>   DW_AT_data_member_location: (data1) 40
│ │   <2><b25>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <b26>   DW_AT_name        : (strp) (offset: 0x205a): shape
│ │ -    <b2a>   DW_AT_decl_file   : (data1) 20
│ │ +    <b26>   DW_AT_name        : (strp) (offset: 0x208b): shape
│ │ +    <b2a>   DW_AT_decl_file   : (data1) 21
│ │      <b2b>   DW_AT_decl_line   : (data1) 29
│ │      <b2c>   DW_AT_decl_column : (data1) 17
│ │      <b2d>   DW_AT_type        : (ref4) <0xb65>, Py_ssize_t, ssize_t, long int
│ │      <b31>   DW_AT_data_member_location: (data1) 48
│ │   <2><b32>: Abbrev Number: 15 (DW_TAG_member)
│ │      <b33>   DW_AT_name        : (strp) (offset: 0x23f): strides
│ │ -    <b37>   DW_AT_decl_file   : (data1) 20
│ │ +    <b37>   DW_AT_decl_file   : (data1) 21
│ │      <b38>   DW_AT_decl_line   : (data1) 30
│ │      <b39>   DW_AT_decl_column : (data1) 17
│ │      <b3a>   DW_AT_type        : (ref4) <0xb65>, Py_ssize_t, ssize_t, long int
│ │      <b3e>   DW_AT_data_member_location: (data1) 56
│ │   <2><b3f>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <b40>   DW_AT_name        : (strp) (offset: 0x14e8): suboffsets
│ │ -    <b44>   DW_AT_decl_file   : (data1) 20
│ │ +    <b40>   DW_AT_name        : (strp) (offset: 0x150d): suboffsets
│ │ +    <b44>   DW_AT_decl_file   : (data1) 21
│ │      <b45>   DW_AT_decl_line   : (data1) 31
│ │      <b46>   DW_AT_decl_column : (data1) 17
│ │      <b47>   DW_AT_type        : (ref4) <0xb65>, Py_ssize_t, ssize_t, long int
│ │      <b4b>   DW_AT_data_member_location: (data1) 64
│ │   <2><b4c>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <b4d>   DW_AT_name        : (strp) (offset: 0x137f): internal
│ │ -    <b51>   DW_AT_decl_file   : (data1) 20
│ │ +    <b4d>   DW_AT_name        : (strp) (offset: 0x13a4): internal
│ │ +    <b51>   DW_AT_decl_file   : (data1) 21
│ │      <b52>   DW_AT_decl_line   : (data1) 32
│ │      <b53>   DW_AT_decl_column : (data1) 11
│ │      <b54>   DW_AT_type        : (ref4) <0x88>
│ │      <b58>   DW_AT_data_member_location: (data1) 72
│ │   <2><b59>: Abbrev Number: 0
│ │   <1><b5a>: Abbrev Number: 10 (DW_TAG_pointer_type)
│ │      <b5b>   DW_AT_byte_size   : (data1) 8
│ │ @@ -1558,15 +1558,15 @@
│ │   <1><b60>: Abbrev Number: 5 (DW_TAG_const_type)
│ │      <b61>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │   <1><b65>: Abbrev Number: 10 (DW_TAG_pointer_type)
│ │      <b66>   DW_AT_byte_size   : (data1) 8
│ │      <b67>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
│ │   <1><b6b>: Abbrev Number: 3 (DW_TAG_typedef)
│ │      <b6c>   DW_AT_name        : (strp) (offset: 0x88a): Py_buffer
│ │ -    <b70>   DW_AT_decl_file   : (data1) 20
│ │ +    <b70>   DW_AT_decl_file   : (data1) 21
│ │      <b71>   DW_AT_decl_line   : (data1) 33
│ │      <b72>   DW_AT_decl_column : (data1) 3
│ │      <b73>   DW_AT_type        : (ref4) <0xac1>
│ │   <1><b77>: Abbrev Number: 10 (DW_TAG_pointer_type)
│ │      <b78>   DW_AT_byte_size   : (data1) 8
│ │      <b79>   DW_AT_type        : (ref4) <0x43a>, PyTypeObject, _typeobject
│ │   <1><b7d>: Abbrev Number: 21 (DW_TAG_structure_type)
│ │ @@ -1579,29 +1579,29 @@
│ │      <b87>   DW_AT_name        : (strp) (offset: 0x387): ob_base
│ │      <b8b>   DW_AT_decl_file   : (data1) 2
│ │      <b8c>   DW_AT_decl_line   : (data1) 110
│ │      <b8d>   DW_AT_decl_column : (data1) 14
│ │      <b8e>   DW_AT_type        : (ref4) <0x3d2>, PyObject, _object
│ │      <b92>   DW_AT_data_member_location: (data1) 0
│ │   <2><b93>: Abbrev Number: 15 (DW_TAG_member)
│ │ -    <b94>   DW_AT_name        : (strp) (offset: 0x13c9): ob_size
│ │ +    <b94>   DW_AT_name        : (strp) (offset: 0x13ee): ob_size
│ │      <b98>   DW_AT_decl_file   : (data1) 2
│ │      <b99>   DW_AT_decl_line   : (data1) 111
│ │      <b9a>   DW_AT_decl_column : (data1) 16
│ │      <b9b>   DW_AT_type        : (ref4) <0x1ab>, Py_ssize_t, ssize_t, long int
│ │      <b9f>   DW_AT_data_member_location: (data1) 16
│ │   <2><ba0>: Abbrev Number: 0
│ │   <1><ba1>: Abbrev Number: 3 (DW_TAG_typedef)
│ │ -    <ba2>   DW_AT_name        : (strp) (offset: 0xb90): PyVarObject
│ │ +    <ba2>   DW_AT_name        : (strp) (offset: 0xb95): PyVarObject
│ │      <ba6>   DW_AT_decl_file   : (data1) 2
│ │      <ba7>   DW_AT_decl_line   : (data1) 112
│ │      <ba8>   DW_AT_decl_column : (data1) 3
│ │      <ba9>   DW_AT_type        : (ref4) <0xb7d>
│ │   <1><bad>: Abbrev Number: 3 (DW_TAG_typedef)
│ │ -    <bae>   DW_AT_name        : (strp) (offset: 0xd27): unaryfunc
│ │ +    <bae>   DW_AT_name        : (strp) (offset: 0xd40): unaryfunc
│ │      <bb2>   DW_AT_decl_file   : (data1) 2
│ │      <bb3>   DW_AT_decl_line   : (data1) 196
│ │      <bb4>   DW_AT_decl_column : (data1) 22
│ │      <bb5>   DW_AT_type        : (ref4) <0xbb9>, PyObject, _object
│ │   <1><bb9>: Abbrev Number: 10 (DW_TAG_pointer_type)
│ │      <bba>   DW_AT_byte_size   : (data1) 8
│ │      <bbb>   DW_AT_type        : (ref4) <0xbbf>, PyObject, _object
│ │ @@ -1609,15 +1609,15 @@
│ │      <bc0>   DW_AT_prototyped  : (flag_present) 1
│ │      <bc0>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │      <bc4>   DW_AT_sibling     : (ref4) <0xbce>
│ │   <2><bc8>: Abbrev Number: 23 (DW_TAG_formal_parameter)
│ │      <bc9>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │   <2><bcd>: Abbrev Number: 0
│ │   <1><bce>: Abbrev Number: 3 (DW_TAG_typedef)
│ │ -    <bcf>   DW_AT_name        : (strp) (offset: 0x1d4d): binaryfunc
│ │ +    <bcf>   DW_AT_name        : (strp) (offset: 0x1d7e): binaryfunc
│ │      <bd3>   DW_AT_decl_file   : (data1) 2
│ │      <bd4>   DW_AT_decl_line   : (data1) 197
│ │      <bd5>   DW_AT_decl_column : (data1) 22
│ │      <bd6>   DW_AT_type        : (ref4) <0xbda>, PyObject, _object
│ │   <1><bda>: Abbrev Number: 10 (DW_TAG_pointer_type)
│ │      <bdb>   DW_AT_byte_size   : (data1) 8
│ │      <bdc>   DW_AT_type        : (ref4) <0xbe0>, PyObject, _object
│ │ @@ -1647,15 +1647,15 @@
│ │      <c10>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │   <2><c14>: Abbrev Number: 23 (DW_TAG_formal_parameter)
│ │      <c15>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │   <2><c19>: Abbrev Number: 23 (DW_TAG_formal_parameter)
│ │      <c1a>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │   <2><c1e>: Abbrev Number: 0
│ │   <1><c1f>: Abbrev Number: 3 (DW_TAG_typedef)
│ │ -    <c20>   DW_AT_name        : (strp) (offset: 0x14ad): inquiry
│ │ +    <c20>   DW_AT_name        : (strp) (offset: 0x14d2): inquiry
│ │      <c24>   DW_AT_decl_file   : (data1) 2
│ │      <c25>   DW_AT_decl_line   : (data1) 199
│ │      <c26>   DW_AT_decl_column : (data1) 15
│ │      <c27>   DW_AT_type        : (ref4) <0xc2b>, int
│ │   <1><c2b>: Abbrev Number: 10 (DW_TAG_pointer_type)
│ │      <c2c>   DW_AT_byte_size   : (data1) 8
│ │      <c2d>   DW_AT_type        : (ref4) <0xc31>, int
│ │ @@ -1663,15 +1663,15 @@
│ │      <c32>   DW_AT_prototyped  : (flag_present) 1
│ │      <c32>   DW_AT_type        : (ref4) <0x4f>, int
│ │      <c36>   DW_AT_sibling     : (ref4) <0xc40>
│ │   <2><c3a>: Abbrev Number: 23 (DW_TAG_formal_parameter)
│ │      <c3b>   DW_AT_type        : (ref4) <0xb5a>, PyObject, _object
│ │   <2><c3f>: Abbrev Number: 0
│ │   <1><c40>: Abbrev Number: 3 (DW_TAG_typedef)
│ │ -    <c41>   DW_AT_name        : (strp) (offset: 0xc5e): lenfunc
│ │ +    <c41>   DW_AT_name        : (strp) (offset: 0xc63): lenfunc
│ │      <c45>   DW_AT_decl_file   : (data1) 2
│ │      <c46>   DW_AT_decl_line   : (data1) 200
│ │      <c47>   DW_AT_decl_column : (data1) 22
│ │      <c48>   DW_AT_type        : (ref4) <0xc4c>, Py_ssize_t, ssize_t, long int
│ │   <1><c4c>: Abbrev Number: 10 (DW_TAG_pointer_type)
